{
    "title": "Employee Benefits (IAS 19) Disclosure Checklist",
    "version": "1.0",
    "sections": [
        {
            "section": "IAS 19",
            "title": "Employee Benefits",
            "description": "Checklist for presentation and disclosure requirements under IAS 19.",
            "items": [
                {
                    "id": "255",
                    "section": "IAS 19",
                    "reference": "IAS 19.33(b)",
                    "question": "If a multi-employer plan is a defined benefit plan and the entity accounts for the plan as a defined benefit plan, does the entity make the disclosures in the “Defined benefit plans” section and in IAS 19.148(a)–(c)?"
                },
                {
                    "id": "256.1",
                    "section": "IAS 19",
                    "reference": "IAS 19.148(a)",
                    "question": "If sufficient information is not available to use defined benefit accounting for a multi-employer plan that is a defined benefit plan, does the entity disclose a description of the funding arrangements, including the method used to determine the entity’s rate of contributions and any minimum funding requirements?"
                },
                {
                    "id": "257.1",
                    "section": "IAS 19",
                    "reference": "IAS 19.149(a)",
                    "question": "If the entity participates in a defined benefit plan that shares risks between entities under common control, does the entity disclose the contractual agreement or stated policy for charging the net defined benefit cost (or the fact that there is no such policy)?"
                },
                {
                    "id": "257.2",
                    "section": "IAS 19",
                    "reference": "IAS 19.149(b)",
                    "question": "Does the entity disclose the policy for determining the contribution to be paid by the entity?"
                },
                {
                    "id": "257.3",
                    "section": "IAS 19",
                    "reference": "IAS 19.149(c)",
                    "question": "If the entity allocates the net defined benefit cost under IAS 19.41, does it disclose all the information about the plan as a whole required by IAS 19.135–147?"
                },
                {
                    "id": "257.4",
                    "section": "IAS 19",
                    "reference": "IAS 19.149(d)",
                    "question": "If the entity accounts only for the contribution payable under IAS 19.41, does it disclose the information about the plan as a whole required by IAS 19.135–137, 139, 142–144 and 147(a)–(b)?"
                },
                {
                    "id": "258",
                    "section": "IAS 19",
                    "reference": "IAS 19.53",
                    "question": "Does the entity disclose the amount recognised as an expense for defined contribution plans?"
                },
                {
                    "id": "259",
                    "section": "IAS 19",
                    "reference": "IAS 19.54, IAS 24.17",
                    "question": "Does the entity disclose contributions to defined contribution plans for key management personnel, when required by IAS 24?"
                },
                {
                    "id": "260.1",
                    "section": "IAS 19",
                    "reference": "IAS 19.139(a)",
                    "question": "Does the entity disclose information about the characteristics of its defined benefit plans, including the nature of the benefits provided, the regulatory framework (such as minimum funding requirements and the asset ceiling) and the governance responsibilities (e.g., trustees or board members)?"
                },
                {
                    "id": "260.2",
                    "section": "IAS 19",
                    "reference": "IAS 19.139(b)",
                    "question": "Does the entity disclose a description of the risks to which the plan exposes the entity, including any significant concentrations of risk?"
                },
                {
                    "id": "260.3",
                    "section": "IAS 19",
                    "reference": "IAS 19.139(c)",
                    "question": "Does the entity disclose any plan amendments, curtailments and settlements?"
                },
                {
                    "id": "261.1",
                    "section": "IAS 19",
                    "reference": "IAS 19.140(a)",
                    "question": "Does the entity provide a reconciliation from the opening balance to the closing balance of the net defined benefit liability (asset), showing separately plan assets, the defined benefit obligation and the effect of the asset ceiling?"
                },
                {
                    "id": "261.2",
                    "section": "IAS 19",
                    "reference": "IAS 19.140(b)",
                    "question": "Does the entity provide a reconciliation from the opening balance to the closing balance of any reimbursement rights and a description of the relationship between those rights and the related obligations?"
                },
                {
                    "id": "262.1",
                    "section": "IAS 19",
                    "reference": "IAS 19.141(a)",
                    "question": "Does each reconciliation show the current service cost?"
                },
                {
                    "id": "262.2",
                    "section": "IAS 19",
                    "reference": "IAS 19.141(b)",
                    "question": "Does each reconciliation show interest income or expense?"
                },
                {
                    "id": "262.3",
                    "section": "IAS 19",
                    "reference": "IAS 19.141(c)",
                    "question": "Does each reconciliation show remeasurements of the net defined benefit liability (asset), including the return on plan assets (excluding amounts included elsewhere) and actuarial gains and losses from changes in financial assumptions?"
                },
                {
                    "id": "262.4",
                    "section": "IAS 19",
                    "reference": "IAS 19.141(e)",
                    "question": "Does each reconciliation show the effect of changes in foreign exchange rates?"
                },
                {
                    "id": "262.5",
                    "section": "IAS 19",
                    "reference": "IAS 19.141(f)",
                    "question": "Does each reconciliation show contributions to the plan, separated by employer and plan participants?"
                },
                {
                    "id": "262.6",
                    "section": "IAS 19",
                    "reference": "IAS 19.141(g)",
                    "question": "Does each reconciliation show payments from the plan, indicating amounts paid in respect of settlements?"
                },
                {
                    "id": "262.7",
                    "section": "IAS 19",
                    "reference": "IAS 19.141(h)",
                    "question": "Does each reconciliation show the effects of business combinations and disposals?"
                },
                {
                    "id": "263",
                    "section": "IAS 19",
                    "reference": "IAS 19.142",
                    "question": "Does the entity disaggregate the fair value of plan assets into classes that distinguish their nature and risks, subdividing each class into assets with quoted market prices in active markets and those without (e.g., investment funds, asset-backed securities, structured debt)?"
                },
                {
                    "id": "264",
                    "section": "IAS 19",
                    "reference": "IAS 19.143",
                    "question": "Does the entity disclose the fair value of its own transferable financial instruments held as plan assets and the fair value of plan assets that are property occupied or other assets used by the entity?"
                },
                {
                    "id": "265",
                    "section": "IAS 19",
                    "reference": "IAS 19.144",
                    "question": "Does the entity disclose the significant actuarial assumptions used to determine the present value of the defined benefit obligation in absolute terms, and, if aggregated for multiple plans, present them as weighted averages or narrow ranges?"
                },
                {
                    "id": "266.1",
                    "section": "IAS 19",
                    "reference": "IAS 19.145(a)",
                    "question": "Does the entity disclose a sensitivity analysis for each significant actuarial assumption, showing how the defined benefit obligation would have been affected by reasonably possible changes at the reporting date?"
                },
                {
                    "id": "266.2",
                    "section": "IAS 19",
                    "reference": "IAS 19.145(b)",
                    "question": "Does the entity disclose the methods, assumptions and limitations used in preparing the required sensitivity analyses?"
                },
                {
                    "id": "266.3",
                    "section": "IAS 19",
                    "reference": "IAS 19.145(c)",
                    "question": "Does the entity disclose changes from the previous period in the methods and assumptions used for sensitivity analyses and the reasons for those changes?"
                },
                {
                    "id": "267",
                    "section": "IAS 19",
                    "reference": "IAS 19.146",
                    "question": "Does the entity disclose any asset-liability matching strategies used by the plan or entity, such as annuities or longevity swaps, to manage risk?"
                },
                {
                    "id": "268",
                    "section": "IAS 19",
                    "reference": "IAS 19.147",
                    "question": "Does the entity disclose the information required by IAS 19.147 to indicate the effect of the defined benefit plan on its future cash flows?"
                },
                {
                    "id": "269.1",
                    "section": "IAS 19",
                    "reference": "IAS 19.151(a), IAS 24",
                    "question": "Where required by IAS 24, does the entity disclose related-party transactions with post-employment benefit plans?"
                },
                {
                    "id": "269.2",
                    "section": "IAS 19",
                    "reference": "IAS 19.151(b), IAS 24",
                    "question": "Where required by IAS 24, does the entity disclose post-employment benefits for key management personnel?"
                },
                {
                    "id": "270",
                    "section": "IAS 19",
                    "reference": "IAS 19.152, IAS 37.27–30, 86–88, 91–92",
                    "question": "Where required by IAS 37, does the entity disclose contingent liabilities arising from post-employment benefit obligations?"
                }
            ]
        }
    ]
}