{
    "title": "Investment Property (IAS 40) Disclosure Checklist",
    "version": "1.0",
    "sections": [
        {
            "section": "IAS 40",
            "title": "Investment property",
            "description": "Checklist for presentation and disclosure requirements under IAS 40.",
            "items": [
                {
                    "id": "426",
                    "section": "IAS 40",
                    "reference": "IAS 40.84E(b)",
                    "question": "If an entity reclassifies property at the date of initial application of Amendments to IAS 40 – Transfers of Investment Property, does it disclose the amounts reclassified to, or from, investment property in accordance with paragraph 84C as part of the reconciliation of the carrying amount of investment property at the beginning and end of the period as required by paragraphs 76 and 79?"
                },
                {
                    "id": "427.1",
                    "section": "IAS 40",
                    "reference": "IAS 40.75(a)",
                    "question": "Does the entity disclose whether it applies the fair value model or the cost model?"
                },
                {
                    "id": "427.2",
                    "section": "IAS 40",
                    "reference": "IAS 40.75(b)",
                    "question": "If classification is difficult, does the entity disclose the criteria it uses to distinguish investment property from owner-occupied property and from property held for sale in the ordinary course of business?"
                },
                {
                    "id": "427.3",
                    "section": "IAS 40",
                    "reference": "IAS 40.75(c)",
                    "question": "Does the entity disclose the fair value measurement disclosures required by IFRS 13?"
                },
                {
                    "id": "427.4",
                    "section": "IAS 40",
                    "reference": "IAS 40.75(d)",
                    "question": "Does the entity disclose the extent to which the fair value of investment property is based on a valuation by an independent valuer with a recognised professional qualification and recent experience in the location and category of the property?"
                },
                {
                    "id": "427.5",
                    "section": "IAS 40",
                    "reference": "IAS 40.75(e)",
                    "question": "If there is no valuation by an independent valuer as described, does the entity disclose that fact?"
                },
                {
                    "id": "427.6",
                    "section": "IAS 40",
                    "reference": "IAS 40.75(f)",
                    "question": "Does the entity disclose the amounts included in profit or loss for rental income from investment property?"
                },
                {
                    "id": "427.7",
                    "section": "IAS 40",
                    "reference": "IAS 40.75(g)",
                    "question": "Does the entity disclose the existence and amounts of restrictions on the realisability of investment property or on the remittance of income and proceeds of disposal?"
                },
                {
                    "id": "427.8",
                    "section": "IAS 40",
                    "reference": "IAS 40.75(h)",
                    "question": "Does the entity disclose its contractual obligations to purchase, construct or develop investment property or for repairs, maintenance or enhancements?"
                },
                {
                    "id": "428.1",
                    "section": "IAS 40",
                    "reference": "IAS 40.76(a)",
                    "question": "If the entity applies the fair value model, does it reconcile additions (disclosing separately those from acquisitions and those from subsequent expenditure)?"
                },
                {
                    "id": "428.2",
                    "section": "IAS 40",
                    "reference": "IAS 40.76(b)",
                    "question": "Does the reconciliation include additions resulting from acquisitions through business combinations?"
                },
                {
                    "id": "428.3",
                    "section": "IAS 40",
                    "reference": "IAS 40.76(c)",
                    "question": "Does the reconciliation include assets classified as held for sale or included in a disposal group classified as held for sale under IFRS 5, and other disposals?"
                },
                {
                    "id": "428.4",
                    "section": "IAS 40",
                    "reference": "IAS 40.76(d)",
                    "question": "Does the reconciliation include net gains or losses from fair value adjustments?"
                },
                {
                    "id": "428.5",
                    "section": "IAS 40",
                    "reference": "IAS 40.76(e)",
                    "question": "Does the reconciliation include the net exchange differences arising on translation into a different presentation currency and on translation of a foreign operation?"
                },
                {
                    "id": "428.6",
                    "section": "IAS 40",
                    "reference": "IAS 40.76(f)",
                    "question": "Does the reconciliation include transfers to and from inventories and owner-occupied property?"
                },
                {
                    "id": "428.7",
                    "section": "IAS 40",
                    "reference": "IAS 40.76(g)",
                    "question": "Does the reconciliation include other changes?"
                },
                {
                    "id": "429.1",
                    "section": "IAS 40",
                    "reference": "IAS 40.77(a)",
                    "question": "If the entity adjusts a valuation obtained for investment property, does it reconcile between the valuation obtained and the adjusted valuation, showing the aggregate amount of recognized lease liabilities that have been added back?"
                },
                {
                    "id": "429.2",
                    "section": "IAS 40",
                    "reference": "IAS 40.77(b)",
                    "question": "Does the reconciliation show any other significant adjustments?"
                },
                {
                    "id": "430.1",
                    "section": "IAS 40",
                    "reference": "IAS 40.78(a)",
                    "question": "In exceptional cases where fair value cannot be reliably measured and cost model is used, does the entity present a separate reconciliation under IAS 40.76 of the carrying amount at the beginning and end of the period for that property?"
                },
                {
                    "id": "430.2",
                    "section": "IAS 40",
                    "reference": "IAS 40.78(b)",
                    "question": "Does the entity provide a description of the investment property?"
                },
                {
                    "id": "430.3",
                    "section": "IAS 40",
                    "reference": "IAS 40.78(c)",
                    "question": "Does the entity explain why fair value cannot be measured reliably?"
                },
                {
                    "id": "430.4",
                    "section": "IAS 40",
                    "reference": "IAS 40.78(d)",
                    "question": "If possible, does the entity disclose the range of estimates within which fair value is highly likely to lie?"
                },
                {
                    "id": "430.5",
                    "section": "IAS 40",
                    "reference": "IAS 40.78(e)",
                    "question": "On disposal of investment property not carried at fair value, does the entity disclose the fact of disposal, the carrying amount at the time of sale, and the amount of gain or loss recognised?"
                },
                {
                    "id": "431.1",
                    "section": "IAS 40",
                    "reference": "IAS 40.79(a)",
                    "question": "If the entity applies the cost model, does it disclose the depreciation methods used?"
                },
                {
                    "id": "431.2",
                    "section": "IAS 40",
                    "reference": "IAS 40.79(b)",
                    "question": "Does the entity disclose the useful lives or the depreciation rates used?"
                },
                {
                    "id": "431.3",
                    "section": "IAS 40",
                    "reference": "IAS 40.79(c)",
                    "question": "Does the entity disclose the gross carrying amount and the accumulated depreciation (aggregated with accumulated impairment losses) at the beginning and end of the period?"
                },
                {
                    "id": "431.4",
                    "section": "IAS 40",
                    "reference": "IAS 40.79(d)",
                    "question": "Does the entity disclose a reconciliation of the carrying amount at the beginning and end of the period, showing additions (disclosing separately those additions)?"
                },
                {
                    "id": "431.5",
                    "section": "IAS 40",
                    "reference": "IAS 40.79(e)",
                    "question": "Does the entity disclose the fair value of investment property?"
                },
                {
                    "id": "431.6",
                    "section": "IAS 40",
                    "reference": "IAS 40.79(f)",
                    "question": "In exceptional cases where fair value cannot be measured reliably, does the entity disclose a description of the property, an explanation of why fair value cannot be reliably measured, and if possible, the range of estimates within which fair value is highly likely to lie?"
                }
            ]
        }
    ]
}