{
    "title": "Intangible Assets (IAS 38) Disclosure Checklist",
    "version": "1.0",
    "sections": [
        {
            "section": "IAS 38",
            "title": "Intangible assets",
            "description": "Checklist for presentation and disclosure requirements under IAS 38.",
            "items": [
                {
                    "id": "418.1",
                    "section": "IAS 38",
                    "reference": "IAS 38.118(a)",
                    "question": "Does the entity disclose whether the useful lives are indefinite or finite and, if finite, the useful lives or the amortisation rates used?"
                },
                {
                    "id": "418.2",
                    "section": "IAS 38",
                    "reference": "IAS 38.118(b)",
                    "question": "Does the entity disclose the amortisation methods used for intangible assets with finite useful lives?"
                },
                {
                    "id": "418.3",
                    "section": "IAS 38",
                    "reference": "IAS 38.118(c)(i)",
                    "question": "Does the entity disclose the gross carrying amount and the accumulated amortisation (aggregated with accumulated impairment losses) of assets classified as held for sale or included in a disposal group classified as held for sale under IFRS 5 and other disposals?"
                },
                {
                    "id": "418.4",
                    "section": "IAS 38",
                    "reference": "IAS 38.118(c)(ii)",
                    "question": "Does the entity disclose increases or decreases during the reporting period resulting from revaluations under IAS 38.75, IAS 38.85 and IAS 38.86, and from impairment losses recognised or reversed in other comprehensive income under IAS 36, if any?"
                },
                {
                    "id": "418.5",
                    "section": "IAS 38",
                    "reference": "IAS 38.118(c)(iii)",
                    "question": "Does the entity disclose impairment losses recognised in profit or loss during the reporting period under IAS 36, if any?"
                },
                {
                    "id": "418.6",
                    "section": "IAS 38",
                    "reference": "IAS 38.118(c)(iv)",
                    "question": "Does the entity disclose impairment losses reversed in profit or loss during the reporting period under IAS 36, if any?"
                },
                {
                    "id": "418.7",
                    "section": "IAS 38",
                    "reference": "IAS 38.118(c)(v)",
                    "question": "Does the entity disclose any amortisation recognised during the reporting period?"
                },
                {
                    "id": "418.8",
                    "section": "IAS 38",
                    "reference": "IAS 38.118(c)(vi)",
                    "question": "Does the entity disclose net exchange differences arising on the translation of the financial statements into the presentation currency, and on the translation of a foreign operation into the presentation currency of the reporting entity?"
                },
                {
                    "id": "418.9",
                    "section": "IAS 38",
                    "reference": "IAS 38.118(c)(vii)",
                    "question": "Does the entity disclose other changes in the carrying amount during the reporting period?"
                },
                {
                    "id": "419.1",
                    "section": "IAS 38",
                    "reference": "IAS 38.122(a)",
                    "question": "For an intangible asset assessed as having an indefinite useful life, does the entity disclose the carrying amount of that asset and reasons supporting the assessment of an indefinite useful life?"
                },
                {
                    "id": "419.2",
                    "section": "IAS 38",
                    "reference": "IAS 38.122(b)",
                    "question": "In giving the reasons for an indefinite useful life, does the entity disclose the factor(s) that play a significant role in determining that the asset has an indefinite useful life?"
                },
                {
                    "id": "419.3",
                    "section": "IAS 38",
                    "reference": "IAS 38.122(c)",
                    "question": "For any individual intangible asset that is material to the entity’s financial statements, does the entity disclose a description of that intangible asset, its carrying amount, and its remaining amortisation period?"
                },
                {
                    "id": "419.4",
                    "section": "IAS 38",
                    "reference": "IAS 38.122(d)",
                    "question": "For intangible assets acquired by way of a government grant and initially recognised at fair value, does the entity disclose the fair value initially recognised for these assets, their carrying amount, and whether they are measured after recognition under the cost model or the revaluation model?"
                },
                {
                    "id": "419.5",
                    "section": "IAS 38",
                    "reference": "IAS 38.122(e)",
                    "question": "Does the entity disclose the existence and carrying amounts of intangible assets whose title is restricted and the carrying amounts of intangible assets pledged as security for liabilities?"
                },
                {
                    "id": "419.6",
                    "section": "IAS 38",
                    "reference": "IAS 38.122(f)",
                    "question": "Does the entity disclose the amount of contractual commitments for the acquisition of intangible assets?"
                },
                {
                    "id": "420.1",
                    "section": "IAS 38",
                    "reference": "IAS 38.124(a)(i)",
                    "question": "If the entity accounts for intangible assets at revalued amounts, does it disclose, by class of intangible assets, the effective date of the revaluation and the carrying amount of revalued intangible assets?"
                },
                {
                    "id": "420.2",
                    "section": "IAS 38",
                    "reference": "IAS 38.124(a)(ii)",
                    "question": "If the entity accounts for intangible assets at revalued amounts, does it disclose, by class, the carrying amount that would have been recognised had the revalued class of intangible assets been measured after recognition using the cost model in IAS 38.74?"
                },
                {
                    "id": "420.3",
                    "section": "IAS 38",
                    "reference": "IAS 38.124(b)",
                    "question": "Does the entity disclose the amount of the revaluation surplus that relates to intangible assets at the beginning and end of the reporting period, indicating the changes during the period and any restrictions on distribution to shareholders?"
                },
                {
                    "id": "420.4",
                    "section": "IAS 38",
                    "reference": "IAS 38.124(c)",
                    "question": "Does the entity disclose the fair value measurement disclosures required by IFRS 13 for intangible assets measured at revalued amounts?"
                },
                {
                    "id": "421",
                    "section": "IAS 38",
                    "reference": "IAS 38.126",
                    "question": "Does the entity disclose the aggregate amount of research and development expenditure recognised as an expense during the reporting period?"
                },
                {
                    "id": "422.1",
                    "section": "IAS 38",
                    "reference": "IAS 38.128(a)",
                    "question": "Does the entity disclose any fully amortised intangible asset that is still in use?"
                },
                {
                    "id": "422.2",
                    "section": "IAS 38",
                    "reference": "IAS 38.128(b)",
                    "question": "Does the entity disclose significant intangible assets controlled by the entity but not recognised as assets because they do not meet IAS 38’s recognition criteria or were acquired or generated before the version of IAS 38 issued in 1998 was effective?"
                }
            ]
        }
    ]
}