{
    "title": "Income Taxes (IAS 12) Disclosure Checklist",
    "version": "1.0",
    "sections": [
        {
            "section": "IAS 12",
            "title": "Income Taxes",
            "description": "Checklist for presentation and disclosure requirements under IAS 12.",
            "items": [
                {
                    "id": "407.1",
                    "section": "IAS 12",
                    "reference": "IAS 12.79(a)",
                    "question": "Does the entity disclose separately the current tax expense (income)?"
                },
                {
                    "id": "407.2",
                    "section": "IAS 12",
                    "reference": "IAS 12.79(b)",
                    "question": "Does the entity disclose any adjustments recognised in the period for current tax of prior periods?"
                },
                {
                    "id": "407.3",
                    "section": "IAS 12",
                    "reference": "IAS 12.79(c)",
                    "question": "Does the entity disclose the deferred tax expense (income) relating to the origination and reversal of temporary differences?"
                },
                {
                    "id": "407.4",
                    "section": "IAS 12",
                    "reference": "IAS 12.80",
                    "question": "Does the entity disclose the deferred tax expense (income) relating to changes in tax rates or the imposition of new taxes?"
                },
                {
                    "id": "407.5",
                    "section": "IAS 12",
                    "reference": "IAS 12.79(e)",
                    "question": "Does the entity disclose the benefit arising from a previously unrecognised tax loss, tax credit or temporary difference of a prior period that is used to reduce current tax expense?"
                },
                {
                    "id": "408.1",
                    "section": "IAS 12",
                    "reference": "IAS 12.81(a)",
                    "question": "Does the entity disclose the aggregate current and deferred tax relating to items that are charged or credited directly to equity (IAS 12.62A)?"
                },
                {
                    "id": "408.2",
                    "section": "IAS 12",
                    "reference": "IAS 12.81(b)",
                    "question": "Does the entity disclose the amount of income tax relating to each component of other comprehensive income (IAS 12.62 and IAS 1)?"
                },
                {
                    "id": "408.3",
                    "section": "IAS 12",
                    "reference": "IAS 12.81(c)(i)",
                    "question": "Does the entity disclose a numerical reconciliation between tax expense (income) and accounting profit or loss?"
                },
                {
                    "id": "408.4",
                    "section": "IAS 12",
                    "reference": "IAS 12.81(c)(ii)",
                    "question": "Does the entity disclose the amount (tax rate) explaining the differences?"
                },
                {
                    "id": "408.5",
                    "section": "IAS 12",
                    "reference": "IAS 12.81(c)(iii)",
                    "question": "Does the entity disclose the expiry date, if any, of unused tax losses or credits?"
                },
                {
                    "id": "408.6",
                    "section": "IAS 12",
                    "reference": "IAS 12.81(f)",
                    "question": "Does the entity disclose the aggregate amount of temporary differences associated with investments in subsidiaries, branches and associates and interests in joint arrangements, for which deferred tax liabilities have not been recognised?"
                },
                {
                    "id": "409.1",
                    "section": "IAS 12",
                    "reference": "IAS 12.67",
                    "question": "If a business combination causes a change in the amount recognised for a pre-acquisition deferred tax asset, does the entity disclose the amount of that change?"
                },
                {
                    "id": "409.2",
                    "section": "IAS 12",
                    "reference": "IAS 12.68",
                    "question": "If deferred tax benefits acquired in a business combination are not recognised at the acquisition date but are recognised after, does the entity disclose the event or change in circumstances that caused those benefits to be recognised?"
                },
                {
                    "id": "410.1",
                    "section": "IAS 12",
                    "reference": "IAS 12.82(a)",
                    "question": "If utilisation of a deferred tax asset depends on future taxable profits and the entity has suffered a loss in the relevant jurisdiction, does the entity disclose the amount of the deferred tax asset?"
                },
                {
                    "id": "410.2",
                    "section": "IAS 12",
                    "reference": "IAS 12.82(b)",
                    "question": "Does the entity disclose the nature of the evidence supporting recognition of the deferred tax asset?"
                },
                {
                    "id": "411.1",
                    "section": "IAS 12",
                    "reference": "IAS 12.82A",
                    "question": "In the circumstances in IAS 12.52A, does the entity disclose the nature of the potential income tax consequences resulting from the payment of dividends to its shareholders, including key features of the tax system and factors affecting the amount?"
                },
                {
                    "id": "411.2",
                    "section": "IAS 12",
                    "reference": "IAS 12.82A",
                    "question": "Does the entity disclose the amounts of the potential income tax consequences that are practicably determinable?"
                },
                {
                    "id": "411.3",
                    "section": "IAS 12",
                    "reference": "IAS 12.87A",
                    "question": "Does the entity disclose whether there are any potential income tax consequences that are not practicably determinable?"
                },
                {
                    "id": "412",
                    "section": "IAS 12",
                    "reference": "IAS 12.87A",
                    "question": "Do the parent’s separate financial statements, if any, disclose the potential income tax consequences relating to the parent’s retained earnings?"
                },
                {
                    "id": "413",
                    "section": "IAS 12",
                    "reference": "IAS 12.88, IAS 37.86",
                    "question": "Does the entity disclose any tax-related contingent liabilities and contingent assets in accordance with IAS 37?"
                },
                {
                    "id": "414",
                    "section": "IAS 12",
                    "reference": "IAS 12.88A",
                    "question": "Does the entity disclose that it has applied the exception to recognising and disclosing information about deferred tax assets and liabilities related to Pillar Two income taxes?"
                },
                {
                    "id": "415",
                    "section": "IAS 12",
                    "reference": "IAS 12.88B",
                    "question": "Does the entity separately disclose its current tax expense (income) related to Pillar Two income taxes?"
                },
                {
                    "id": "416",
                    "section": "IAS 12",
                    "reference": "IAS 12.88C",
                    "question": "In periods in which Pillar Two legislation is enacted or substantively enacted but not yet in effect, does the entity disclose known or reasonably estimable information that helps users understand its exposure to Pillar Two income taxes arising from that legislation?"
                },
                {
                    "id": "417",
                    "section": "IAS 12",
                    "reference": "IAS 12.88D",
                    "question": "To the extent information required by paragraph 88C is not known or reasonably estimable, does the entity disclose a statement to that effect and information about its progress in assessing its exposure?"
                }
            ]
        }
    ]
}