{
    "title": "International GAAP® Disclosure Checklist",
    "version": "1.0",
    "sections": [
        {
            "section": "IAS 8",
            "title": "Accounting Policies, Changes in Accounting Estimates and Errors",
            "description": "Checklist for presentation and disclosure requirements under IAS 8.",
            "items": [
                {
                    "id": "144",
                    "section": "IAS 8",
                    "reference": "IAS 8.22",
                    "question": "If retrospective application is required, does the entity disclose the adjustment to the opening balance of each affected component of equity for the earliest prior period presented and the other comparative amounts for each prior period presented as if the entity had always applied the new accounting policy?"
                },
                {
                    "id": "145.1",
                    "section": "IAS 8",
                    "reference": "IAS 8.28(a)",
                    "question": "Does the entity disclose the title of the IFRS accounting standard?"
                },
                {
                    "id": "145.2",
                    "section": "IAS 8",
                    "reference": "IAS 8.28(b)",
                    "question": "Does the entity disclose that the change in accounting policy is made in accordance with its transitional provisions, if applicable?"
                },
                {
                    "id": "145.3",
                    "section": "IAS 8",
                    "reference": "IAS 8.28(c)",
                    "question": "Does the entity disclose the nature of the change in accounting policy?"
                },
                {
                    "id": "145.4",
                    "section": "IAS 8",
                    "reference": "IAS 8.28(d)",
                    "question": "Does the entity disclose the transitional provisions, if applicable?"
                },
                {
                    "id": "145.5",
                    "section": "IAS 8",
                    "reference": "IAS 8.28(e), IAS 33.2",
                    "question": "Does the entity disclose the transitional provisions that might have an effect on future periods, if applicable?"
                },
                {
                    "id": "145.6",
                    "section": "IAS 8",
                    "reference": "IAS 8.28(f)",
                    "question": "Does the entity disclose the amount of the adjustment for each financial statement line item affected and the basic and diluted earnings per share for the current period and each prior period presented, to the extent practicable (if IAS 33 applies)?"
                },
                {
                    "id": "145.7",
                    "section": "IAS 8",
                    "reference": "IAS 8.28(g)",
                    "question": "Does the entity disclose the amount of the adjustment relating to periods before those presented, to the extent practicable?"
                },
                {
                    "id": "145.8",
                    "section": "IAS 8",
                    "reference": "IAS 8.28(h)",
                    "question": "If retrospective application is impracticable for a particular prior period or for periods before those presented, does the entity disclose the circumstances that led to that condition and describe how and from when the change in accounting policy has been applied?"
                },
                {
                    "id": "146.1",
                    "section": "IAS 8",
                    "reference": "IAS 8.29(d)",
                    "question": "Does the entity disclose the basic and diluted earnings per share for the current reporting period and each prior reporting period presented (if IAS 33 applies and to the extent practicable)?"
                },
                {
                    "id": "146.2",
                    "section": "IAS 8",
                    "reference": "IAS 8.29(e)",
                    "question": "Does the entity disclose the amount of the adjustment relating to periods before those presented, to the extent practicable?"
                },
                {
                    "id": "146.3",
                    "section": "IAS 8",
                    "reference": "IAS 8.29(f)",
                    "question": "If retrospective application is impracticable for a particular prior period or for periods before those presented, does the entity disclose the circumstances that led to that condition and describe how and from when the change in accounting policy has been applied?"
                },
                {
                    "id": "147.1",
                    "section": "IAS 8",
                    "reference": "IAS 8.30(a)",
                    "question": "Does the entity disclose the title of the new IFRS accounting standard that is issued but not yet effective?"
                },
                {
                    "id": "147.2",
                    "section": "IAS 8",
                    "reference": "IAS 8.30(b)",
                    "question": "Does the entity disclose the nature of the impending change or changes in accounting policy?"
                },
                {
                    "id": "147.3",
                    "section": "IAS 8",
                    "reference": "IAS 8.30(c)",
                    "question": "Does the entity disclose the date by which application of the IFRS accounting standard is required?"
                },
                {
                    "id": "147.4",
                    "section": "IAS 8",
                    "reference": "IAS 8.30(d)",
                    "question": "Does the entity disclose the date as at which it plans to adopt the IFRS accounting standard initially?"
                },
                {
                    "id": "147.5",
                    "section": "IAS 8",
                    "reference": "IAS 8.30(e)",
                    "question": "Does the entity either discuss the impact that initial application of the IFRS accounting standard is expected to have on its financial statements or, if such impact is not known or reasonably estimable, state that fact?"
                },
                {
                    "id": "173",
                    "section": "IAS 8",
                    "reference": "IAS 1.117, IAS 8.27A",
                    "question": "Does the entity disclose the accounting policy for the recognition of borrowing costs?"
                },
                {
                    "id": "175.1",
                    "section": "IAS 8",
                    "reference": "IAS 8.39(a)",
                    "question": "Does the entity disclose the nature of a change in accounting estimate that has an effect in the current period or is expected to have an effect in future periods?"
                },
                {
                    "id": "175.2",
                    "section": "IAS 8",
                    "reference": "IAS 8.39(b)",
                    "question": "Does the entity disclose the amount of that change in accounting estimate?"
                },
                {
                    "id": "175.3",
                    "section": "IAS 8",
                    "reference": "IAS 8.40(c)",
                    "question": "If applicable, does the entity disclose that the amount of the effect in future periods is not disclosed because estimating it is impracticable?"
                },
                {
                    "id": "247.1",
                    "section": "IAS 8",
                    "reference": "IAS 8.42(a), IAS 8.43(a)",
                    "question": "Does the entity report the amount of the correction of an error by restating the comparative amounts for the prior period(s) in which the error occurred, unless impracticable?"
                },
                {
                    "id": "247.2",
                    "section": "IAS 8",
                    "reference": "IAS 8.42(b), IAS 8.43(b)",
                    "question": "If the error occurred before the earliest prior period presented, does the entity report the amount of the correction by restating the opening balances of assets, liabilities and retained equity, unless impracticable?"
                },
                {
                    "id": "248",
                    "section": "IAS 8",
                    "reference": "IAS 8.43, IAS 8.44",
                    "question": "If it is impracticable to determine the period-specific effects of an error on comparative information, does the entity restate the opening balance of assets, liabilities and equity for the earliest period for which retrospective restatement is practicable?"
                },
                {
                    "id": "249",
                    "section": "IAS 8",
                    "reference": "IAS 8.43, IAS 8.45",
                    "question": "If it is impracticable to determine the cumulative effect at the beginning of the current reporting period of an error on all prior reporting periods, does the entity restate the comparative information to correct the error prospectively from the earliest date practicable?"
                },
                {
                    "id": "250.1",
                    "section": "IAS 8",
                    "reference": "IAS 8.49(a)",
                    "question": "Does the entity disclose the nature of the prior period error?"
                },
                {
                    "id": "250.2",
                    "section": "IAS 8",
                    "reference": "IAS 8.49(b), IAS 33.2",
                    "question": "Does the entity disclose the amount of the correction for each prior period presented, for each financial statement line item affected?"
                },
                {
                    "id": "250.3",
                    "section": "IAS 8",
                    "reference": "IAS 8.49(c)",
                    "question": "Does the entity disclose the amount of the correction for each prior period presented for basic and diluted earnings per share (if IAS 33 applies)?"
                },
                {
                    "id": "250.4",
                    "section": "IAS 8",
                    "reference": "IAS 8.49(d)",
                    "question": "Does the entity disclose the amount of the correction at the beginning of the earliest prior period presented?"
                },
                {
                    "id": "250.5",
                    "section": "IAS 8",
                    "reference": "IAS 8.49(e)",
                    "question": "If retrospective restatement is impracticable for a particular prior period, does the entity disclose the circumstances that led to that condition and describe how and from when the error was corrected?"
                },
                {
                    "id": "328",
                    "section": "IAS 8",
                    "reference": "IFRS 7.21, IAS 1.117, IAS 8.27A",
                    "question": "Does the entity disclose its material accounting policy information (including the measurement basis or bases for financial instruments used)?"
                },
                {
                    "id": "332",
                    "section": "IAS 8",
                    "reference": "IFRS 7.B5, IAS 1.122, IAS 8.27G",
                    "question": "Does the entity disclose management’s judgements for financial instruments that have the most significant effect on the financial statements?"
                },
                {
                    "id": "662",
                    "section": "IAS 8",
                    "reference": "IAS 8.6A, IAS 8.6C, IFRS 18.113",
                    "question": "Does the entity provide additional disclosures when compliance with IFRS Accounting Standards is insufficient to enable users to understand the impact of particular transactions, events and conditions on its financial position and performance?"
                },
                {
                    "id": "663",
                    "section": "IAS 8",
                    "reference": "IAS 8.6B",
                    "question": "Does the entity disclose an explicit and unreserved statement of compliance with IFRS Accounting Standards?"
                },
                {
                    "id": "664.1",
                    "section": "IAS 8",
                    "reference": "IAS 8.6E(a), IAS 8.6F(a)",
                    "question": "Does the entity disclose that management concluded the financial statements present fairly the entity’s position, performance and cash flows when departing from a requirement?"
                },
                {
                    "id": "664.2",
                    "section": "IAS 8",
                    "reference": "IAS 8.6E(b), IAS 8.6F(b)",
                    "question": "Does the entity disclose that it has complied with applicable IFRSs except for the departure required to achieve a fair presentation?"
                },
                {
                    "id": "664.3",
                    "section": "IAS 8",
                    "reference": "IAS 8.6E(c), IAS 8.6F(c)",
                    "question": "Does the entity disclose the title of the IFRS from which it has departed?"
                },
                {
                    "id": "664.4",
                    "section": "IAS 8",
                    "reference": "IAS 8.6E(d), IAS 8.6F(d)",
                    "question": "Does the entity disclose the nature of the departure?"
                },
                {
                    "id": "664.5",
                    "section": "IAS 8",
                    "reference": "IAS 8.6E(e), IAS 8.6F(e)",
                    "question": "Does the entity disclose the treatment that the IFRS would require?"
                },
                {
                    "id": "664.6",
                    "section": "IAS 8",
                    "reference": "IAS 8.6E(f), IAS 8.6F(f)",
                    "question": "Does the entity disclose the reason why that treatment would be so misleading in the circumstances?"
                },
                {
                    "id": "664.7",
                    "section": "IAS 8",
                    "reference": "IAS 8.6E(g), IAS 8.6F(g)",
                    "question": "Does the entity disclose the treatment adopted?"
                },
                {
                    "id": "664.8",
                    "section": "IAS 8",
                    "reference": "IAS 8.6E(h), IAS 8.6F(h)",
                    "question": "For each period presented, does the entity disclose the financial effect of the departure on each item in the financial statements that would have been reported in complying with the requirement?"
                },
                {
                    "id": "665.1",
                    "section": "IAS 8",
                    "reference": "IAS 8.6G(a), IAS 8.6F(a)",
                    "question": "Does the entity disclose the title of the IFRS from which it departed in a prior period?"
                },
                {
                    "id": "665.2",
                    "section": "IAS 8",
                    "reference": "IAS 8.6G(b), IAS 8.6F(b)",
                    "question": "Does the entity disclose the nature of the departure?"
                },
                {
                    "id": "665.3",
                    "section": "IAS 8",
                    "reference": "IAS 8.6G(c), IAS 8.6F(c)",
                    "question": "Does the entity disclose the treatment that the IFRS would require?"
                },
                {
                    "id": "665.4",
                    "section": "IAS 8",
                    "reference": "IAS 8.6G(d), IAS 8.6F(d)",
                    "question": "Does the entity disclose the reason why that treatment would be so misleading in the circumstances?"
                },
                {
                    "id": "665.5",
                    "section": "IAS 8",
                    "reference": "IAS 8.6G(e), IAS 8.6F(e)",
                    "question": "Does the entity disclose the treatment adopted?"
                },
                {
                    "id": "665.6",
                    "section": "IAS 8",
                    "reference": "IAS 8.6G(f), IAS 8.6F(f)",
                    "question": "For each period presented, does the entity disclose the financial effect of the departure on each item in the financial statements that would have been reported in complying with the requirement?"
                },
                {
                    "id": "666.1",
                    "section": "IAS 8",
                    "reference": "IAS 8.6I(a)",
                    "question": "Does the entity disclose the title of the IFRS in question when compliance is misleading but departure is prohibited?"
                },
                {
                    "id": "666.2",
                    "section": "IAS 8",
                    "reference": "IAS 8.6I(b)",
                    "question": "Does the entity disclose the nature of the requirement?"
                },
                {
                    "id": "666.3",
                    "section": "IAS 8",
                    "reference": "IAS 8.6I(c)",
                    "question": "Does the entity disclose the reason why complying with that requirement is misleading in those circumstances?"
                },
                {
                    "id": "666.4",
                    "section": "IAS 8",
                    "reference": "IAS 8.6I(d)",
                    "question": "For each period presented, does the entity disclose the adjustments to each item in the financial statements that management concluded would be necessary to achieve a fair presentation?"
                },
                {
                    "id": "667",
                    "section": "IAS 8",
                    "reference": "IAS 8.6K",
                    "question": "Does the entity disclose material uncertainties related to events or conditions that may cast significant doubt upon its ability to continue as a going concern?"
                },
                {
                    "id": "668.1",
                    "section": "IAS 8",
                    "reference": "IAS 8.6K(a)",
                    "question": "Does the entity disclose the fact that the financial statements are not prepared on a going concern basis?"
                },
                {
                    "id": "668.2",
                    "section": "IAS 8",
                    "reference": "IAS 8.6K(b)",
                    "question": "Does the entity disclose the basis on which the financial statements are prepared if not on a going concern basis?"
                },
                {
                    "id": "668.3",
                    "section": "IAS 8",
                    "reference": "IAS 8.6K(c)",
                    "question": "Does the entity disclose the reason why it is not regarded as a going concern?"
                },
                {
                    "id": "759",
                    "section": "IAS 8",
                    "reference": "IAS 8.27A",
                    "question": "Does the entity disclose material accounting policy information?"
                },
                {
                    "id": "762",
                    "section": "IAS 8",
                    "reference": "IAS 8.22",
                    "question": "If retrospective application is required, does the entity disclose the adjustment to the opening balance of each affected component of equity for the earliest prior period presented and the other comparative amounts for each prior period presented as if the entity had always applied the new accounting policy?"
                },
                {
                    "id": "763.1",
                    "section": "IAS 8",
                    "reference": "IAS 8.28(a)",
                    "question": "Does the entity disclose the title of the IFRS accounting standard?"
                },
                {
                    "id": "763.2",
                    "section": "IAS 8",
                    "reference": "IAS 8.28(b)",
                    "question": "Does the entity disclose that the change in accounting policy is made in accordance with its transitional provisions, if applicable?"
                },
                {
                    "id": "763.3",
                    "section": "IAS 8",
                    "reference": "IAS 8.28(c)",
                    "question": "Does the entity disclose the nature of the change in accounting policy?"
                },
                {
                    "id": "763.4",
                    "section": "IAS 8",
                    "reference": "IAS 8.28(d)",
                    "question": "Does the entity disclose the transitional provisions, if applicable?"
                },
                {
                    "id": "763.5",
                    "section": "IAS 8",
                    "reference": "IAS 8.28(e), IAS 33.2",
                    "question": "Does the entity disclose the transitional provisions that might have an effect on future periods, if applicable?"
                },
                {
                    "id": "763.6",
                    "section": "IAS 8",
                    "reference": "IAS 8.28(f)",
                    "question": "Does the entity disclose the amount of the adjustment for each financial statement line item affected and the basic and diluted earnings per share for the current period and each prior period presented, to the extent practicable (if IAS 33 applies)?"
                },
                {
                    "id": "763.7",
                    "section": "IAS 8",
                    "reference": "IAS 8.28(g)",
                    "question": "Does the entity disclose the amount of the adjustment relating to periods before those presented, to the extent practicable?"
                },
                {
                    "id": "763.8",
                    "section": "IAS 8",
                    "reference": "IAS 8.28(h)",
                    "question": "If retrospective application is impracticable for a particular prior period or for periods before those presented, does the entity disclose the circumstances that led to that condition and describe how and from when the change in accounting policy has been applied?"
                },
                {
                    "id": "764.1",
                    "section": "IAS 8",
                    "reference": "IAS 8.29(a)",
                    "question": "Does the entity disclose the nature of the change in accounting policy?"
                },
                {
                    "id": "764.2",
                    "section": "IAS 8",
                    "reference": "IAS 8.29(e)",
                    "question": "Does the entity disclose the amount of the adjustment relating to periods before those presented, to the extent practicable?"
                },
                {
                    "id": "764.3",
                    "section": "IAS 8",
                    "reference": "IAS 8.29(f)",
                    "question": "If retrospective application is impracticable for a particular prior period or for periods before those presented, does the entity disclose the circumstances that led to that condition and describe how and from when the change in accounting policy has been applied?"
                },
                {
                    "id": "765.1",
                    "section": "IAS 8",
                    "reference": "IAS 8.30(a)",
                    "question": "Does the entity disclose the fact that it did not apply a new IFRS that has been issued but is not yet effective?"
                },
                {
                    "id": "765.2",
                    "section": "IAS 8",
                    "reference": "IAS 8.30(b)",
                    "question": "Does the entity disclose known or reasonably estimable information relevant to assessing the possible impact that application of the new IFRS will have on the financial statements in the period of initial application?"
                },
                {
                    "id": "765.3",
                    "section": "IAS 8",
                    "reference": "IAS 8.30(c)",
                    "question": "Does the entity disclose the title of the new IFRS?"
                },
                {
                    "id": "765.4",
                    "section": "IAS 8",
                    "reference": "IAS 8.30(d)",
                    "question": "Does the entity disclose the nature of the impending change or changes in accounting policy?"
                },
                {
                    "id": "765.5",
                    "section": "IAS 8",
                    "reference": "IAS 8.30(e)",
                    "question": "Does the entity disclose the date by which application of the IFRS is required?"
                },
                {
                    "id": "765.6",
                    "section": "IAS 8",
                    "reference": "IAS 8.30(f)",
                    "question": "Does the entity disclose the date as at which it plans to adopt the IFRS initially?"
                },
                {
                    "id": "765.7",
                    "section": "IAS 8",
                    "reference": "IAS 8.30(g)",
                    "question": "Does the entity discuss the impact that initial application of the IFRS is expected to have on its financial statements or, if such impact is not known or reasonably estimable, state that fact?"
                },
                {
                    "id": "766",
                    "section": "IAS 8",
                    "reference": "IAS 8.31A",
                    "question": "Does the entity disclose information about the assumptions it makes about the future and other major sources of estimation uncertainty at the end of the reporting period that have a significant risk of resulting in a material adjustment to the carrying amounts of assets and liabilities within the next financial year?"
                },
                {
                    "id": "767.1",
                    "section": "IAS 8",
                    "reference": "IAS 8.31A(a)",
                    "question": "For the assets and liabilities in IAS 8.31A, does the entity disclose their nature?"
                },
                {
                    "id": "767.2",
                    "section": "IAS 8",
                    "reference": "IAS 8.31A(b)",
                    "question": "For the assets and liabilities in IAS 8.31A, does the entity disclose their carrying amount as at the end of the reporting period?"
                }
            ]
        }
    ]
}