{
    "title": "International GAAP® Disclosure Checklist",
    "version": "1.0",
    "sections": [
        {
            "section": "IAS 2",
            "title": "Inventories",
            "description": "Checklist for presentation and disclosure requirements under IAS 2.",
            "items": [
                {
                    "id": "423.1",
                    "section": "IAS 2",
                    "reference": "IAS 2.36(a)",
                    "question": "Does the entity disclose the accounting policies for measuring inventories, including the cost formula used?"
                },
                {
                    "id": "423.2",
                    "section": "IAS 2",
                    "reference": "IAS 2.36(b)",
                    "question": "Does the entity disclose the total carrying amount of inventories and the carrying amount in classifications appropriate to the entity?"
                },
                {
                    "id": "423.3",
                    "section": "IAS 2",
                    "reference": "IAS 2.36(c)",
                    "question": "Does the entity disclose the carrying amount of inventories carried at fair value less costs to sell?"
                },
                {
                    "id": "423.4",
                    "section": "IAS 2",
                    "reference": "IAS 2.36(d)",
                    "question": "Does the entity disclose the amount of inventories recognised as an expense during the period?"
                },
                {
                    "id": "423.5",
                    "section": "IAS 2",
                    "reference": "IAS 2.36(e)",
                    "question": "Does the entity disclose the amount of any write-down of inventories recognised as an expense in the period?"
                },
                {
                    "id": "423.6",
                    "section": "IAS 2",
                    "reference": "IAS 2.36(f)",
                    "question": "Does the entity disclose the amount of any reversal of any write-down that is recognised as a reduction in the amount of inventories recognised as expense in the period?"
                },
                {
                    "id": "423.7",
                    "section": "IAS 2",
                    "reference": "IAS 2.36(g)",
                    "question": "Does the entity disclose the circumstances or events that led to the reversal of a write-down of inventories?"
                },
                {
                    "id": "423.8",
                    "section": "IAS 2",
                    "reference": "IAS 2.36(h)",
                    "question": "Does the entity disclose the carrying amount of inventories pledged as security for liabilities?"
                },
                {
                    "id": "424",
                    "section": "IAS 2",
                    "reference": "IAS 2.39",
                    "question": "If the entity adopts a format for profit or loss under IAS 1 that results in amounts being disclosed other than the cost of inventories recognised as an expense during the period and presents an analysis of expenses using a classification based on the nature of expenses, does the entity disclose the costs recognised as an expense for raw materials and consumables, labour costs and other costs together with the amount of the net change in inventories for the period?"
                },
                {
                    "id": "425",
                    "section": "IAS 2",
                    "reference": "IAS 2.39",
                    "question": "If the entity adopts IFRS 18 early and classifies expenses by nature in the operating category of the statement of profit or loss in a way that results in amounts being presented other than the cost of inventories recognised as an expense during the period, does the entity present the costs recognised as an expense for raw materials and consumables, employee benefits and other costs together with the amount of the net change in inventories for the period?"
                }
            ]
        }
    ]
}