{
    "title": "Separate Financial Statements (IAS 27) Disclosure Checklist",
    "version": "1.0",
    "sections": [
        {
            "section": "IAS 27",
            "title": "Separate Financial Statements",
            "description": "Checklist for presentation and disclosure requirements under IAS 27.",
            "items": [
                {
                    "id": "87",
                    "section": "IAS 27",
                    "reference": "IAS 33.4",
                    "question": "If the entity presents both consolidated financial statements and separate financial statements prepared under IFRS 10 and IAS 27, does it present the disclosures required by IAS 33 only on the basis of the consolidated information?"
                },
                {
                    "id": "242.1",
                    "section": "IAS 27",
                    "reference": "IAS 27.16(a)",
                    "question": "In the parent’s separate financial statements, does the entity disclose that the financial statements are separate financial statements?"
                },
                {
                    "id": "242.2",
                    "section": "IAS 27",
                    "reference": "IAS 27.16(b)",
                    "question": "Does the entity disclose that the exemption from consolidation has been used?"
                },
                {
                    "id": "242.3",
                    "section": "IAS 27",
                    "reference": "IAS 27.16(c)",
                    "question": "Does the entity disclose the name and principal place of business (and country of incorporation, if different) of the entity whose consolidated financial statements have been produced for public use (and the address where these are obtainable)?"
                },
                {
                    "id": "242.4",
                    "section": "IAS 27",
                    "reference": "IAS 27.16(d)",
                    "question": "Does the entity disclose a list of significant investments in subsidiaries, joint ventures and associates, including the names of those investees, their principal place of business (and country of incorporation, if different), and the proportion of ownership interest (and, if different, proportion of voting rights) held?"
                },
                {
                    "id": "242.5",
                    "section": "IAS 27",
                    "reference": "IAS 27.16(e)",
                    "question": "Does the entity describe the method used to account for the investments listed under (d)?"
                },
                {
                    "id": "242.6",
                    "section": "IAS 27",
                    "reference": "IAS 27.16(f)",
                    "question": "If the method used to account for investments in subsidiaries, associates and joint ventures is fair value, does the entity disclose the IFRS 13 fair-value measurement disclosures?"
                },
                {
                    "id": "243.1",
                    "section": "IAS 27",
                    "reference": "IAS 27.17(d)",
                    "question": "Does the parent or investor disclose a description of the method used to account for the investments identified under paragraph (c)?"
                },
                {
                    "id": "243.2",
                    "section": "IAS 27",
                    "reference": "IAS 27.17(e)",
                    "question": "If the method used to account for those investments is fair value, does the parent or investor disclose the IFRS 13 fair-value measurement disclosures?"
                },
                {
                    "id": "244",
                    "section": "IAS 27",
                    "reference": "IAS 27.8A",
                    "question": "If an investment entity is required to apply the exception to consolidation for all of its subsidiaries throughout the current and comparative periods, does it present separate financial statements as its only financial statements?"
                },
                {
                    "id": "245",
                    "section": "IAS 27",
                    "reference": "IAS 27.16A",
                    "question": "When an investment entity parent prepares separate financial statements as its only financial statements, does it disclose that fact and present the IFRS 12 disclosures relating to investment entities?"
                },
                {
                    "id": "246.1",
                    "section": "IAS 27",
                    "reference": "IAS 27.17(a)",
                    "question": "Does the parent or investor disclose the fact that the statements are separate financial statements?"
                },
                {
                    "id": "246.2",
                    "section": "IAS 27",
                    "reference": "IAS 27.17(b)",
                    "question": "Does the parent or investor disclose the reasons why those statements are prepared if not required by law?"
                },
                {
                    "id": "246.3",
                    "section": "IAS 27",
                    "reference": "IAS 27.17(c)",
                    "question": "Does the parent or investor disclose a list of significant investments in subsidiaries, joint ventures and associates, including the name of each investee, its principal place of business (and country of incorporation, if different), and the proportion of ownership interest (and voting rights, if different) held?"
                },
                {
                    "id": "246.4",
                    "section": "IAS 27",
                    "reference": "IAS 27.17(d)",
                    "question": "Does the parent or investor describe the method used to account for the investments listed under (c)?"
                },
                {
                    "id": "246.5",
                    "section": "IAS 27",
                    "reference": "IAS 27.17(e)",
                    "question": "If the method used to account for the investments listed under (c) is fair value, does the parent or investor disclose the IFRS 13 fair-value measurement disclosures?"
                }
            ]
        }
    ]
}