{
    "title": "Related Party Disclosures (IAS 24) Disclosure Checklist",
    "version": "1.0",
    "sections": [
        {
            "section": "IAS 24",
            "title": "Related Party Disclosures",
            "description": "Checklist for presentation and disclosure requirements under IAS 24.",
            "items": [
                {
                    "id": "501",
                    "section": "IAS 24",
                    "reference": "IAS 24.12, IAS 24.13",
                    "question": "Does the entity disclose relationships between parents and subsidiaries, irrespective of whether there are transactions between them?"
                },
                {
                    "id": "502.1",
                    "section": "IAS 24",
                    "reference": "IAS 24.12(a), IAS 24.13(a)",
                    "question": "Does the entity disclose the name of the entity’s parent?"
                },
                {
                    "id": "502.2",
                    "section": "IAS 24",
                    "reference": "IAS 24.12(b), IAS 24.13(b)",
                    "question": "Does the entity disclose, if different, the ultimate controlling party?"
                },
                {
                    "id": "502.3",
                    "section": "IAS 24",
                    "reference": "IAS 24.12(c), IAS 24.13(c)",
                    "question": "If neither the entity’s parent nor the ultimate controlling party produces consolidated financial statements available for public use, does the entity disclose the name of the next most senior parent that does so?"
                },
                {
                    "id": "503.1",
                    "section": "IAS 24",
                    "reference": "IAS 24.17(a)",
                    "question": "Does the entity disclose key management personnel compensation for short-term employee benefits?"
                },
                {
                    "id": "503.2",
                    "section": "IAS 24",
                    "reference": "IAS 24.17(b)",
                    "question": "Does the entity disclose key management personnel compensation for post-employment benefits?"
                },
                {
                    "id": "503.3",
                    "section": "IAS 24",
                    "reference": "IAS 24.17(c)",
                    "question": "Does the entity disclose key management personnel compensation for other long-term benefits?"
                },
                {
                    "id": "503.4",
                    "section": "IAS 24",
                    "reference": "IAS 24.17(d)",
                    "question": "Does the entity disclose key management personnel compensation for termination benefits?"
                },
                {
                    "id": "503.5",
                    "section": "IAS 24",
                    "reference": "IAS 24.17(e)",
                    "question": "Does the entity disclose key management personnel compensation for share-based payments?"
                },
                {
                    "id": "504.1",
                    "section": "IAS 24",
                    "reference": "IAS 24.17, IAS 24.18(a)",
                    "question": "If there are related party transactions during the period, does the entity disclose the nature of each related party relationship?"
                },
                {
                    "id": "504.2",
                    "section": "IAS 24",
                    "reference": "IAS 24.17, IAS 24.18(b)",
                    "question": "Does the entity disclose information about related party transactions and outstanding balances, including commitments, necessary for an understanding of their potential effect on the financial statements, specifically: the amount of the transactions; the amount of outstanding balances, including commitments; their terms and conditions (including whether secured and the nature of consideration to be provided); details of any guarantees given or received; provisions for doubtful debts related to outstanding balances; and the expense recognised for bad or doubtful debts due from related parties?"
                },
                {
                    "id": "505.1",
                    "section": "IAS 24",
                    "reference": "IAS 24.18(a)",
                    "question": "Does the entity disclose the information required by IAS 24.18 separately for the parent?"
                },
                {
                    "id": "505.2",
                    "section": "IAS 24",
                    "reference": "IAS 24.18(b)",
                    "question": "Does the entity disclose the information required by IAS 24.18 separately for entities with joint control of or significant influence over the entity?"
                },
                {
                    "id": "505.3",
                    "section": "IAS 24",
                    "reference": "IAS 24.18(c)",
                    "question": "Does the entity disclose the information required by IAS 24.18 separately for subsidiaries?"
                },
                {
                    "id": "505.4",
                    "section": "IAS 24",
                    "reference": "IAS 24.18(d)",
                    "question": "Does the entity disclose the information required by IAS 24.18 separately for associates?"
                },
                {
                    "id": "505.5",
                    "section": "IAS 24",
                    "reference": "IAS 24.18(e)",
                    "question": "Does the entity disclose the information required by IAS 24.18 separately for joint ventures in which the entity is a venturer?"
                },
                {
                    "id": "505.6",
                    "section": "IAS 24",
                    "reference": "IAS 24.18(f)",
                    "question": "Does the entity disclose the information required by IAS 24.18 separately for key management personnel of the entity or its parent?"
                },
                {
                    "id": "505.7",
                    "section": "IAS 24",
                    "reference": "IAS 24.18(g)",
                    "question": "Does the entity disclose the information required by IAS 24.18 separately for other related parties?"
                },
                {
                    "id": "508.1",
                    "section": "IAS 24",
                    "reference": "IAS 24.25(a)",
                    "question": "If the entity applies the exemption in IAS 24.25, does it disclose the name of the government and the nature of its relationship with the reporting entity (control, joint control or significant influence)?"
                },
                {
                    "id": "508.2",
                    "section": "IAS 24",
                    "reference": "IAS 24.25(b), IAS 24.26",
                    "question": "If the entity applies the exemption in IAS 24.25, does it disclose, for transactions and outstanding balances (including commitments), the nature and amount of each individually significant transaction, and for other transactions that are collectively but not individually significant, a qualitative or quantitative indication of their extent?"
                }
            ]
        }
    ]
}