{
    "title": "IFRS 5 Flattened Disclosure Checklist",
    "version": "1.0",
    "sections": [
        {
            "section": "IFRS 5",
            "title": "Non-current assets held for sale and discontinued operations",
            "description": "Flattened checklist for presentation and disclosure requirements under IFRS 5 – atomic, machine-actionable items.",
            "items": [
                {
                    "id": "IFRS5-1.1",
                    "section": "IFRS 5",
                    "reference": "IFRS 5.30, 5.33",
                    "question": "Does the entity present a single amount in the statement of comprehensive income comprising the total of the post-tax profit or loss of discontinued operations and the post-tax gain or loss on measurement to fair value less costs to sell or disposal?"
                },
                {
                    "id": "IFRS5-1.2",
                    "section": "IFRS 5",
                    "reference": "IFRS 5.33(b)",
                    "question": "Does the entity disclose the revenue, expenses and pre-tax profit or loss of discontinued operations and the related income tax expense?"
                },
                {
                    "id": "IFRS5-1.3",
                    "section": "IFRS 5",
                    "reference": "IFRS 5.33(b)",
                    "question": "Does the entity disclose the gain or loss on measurement to fair value less costs to sell or disposal of discontinued operations and the related income tax expense?"
                },
                {
                    "id": "IFRS5-1.4",
                    "section": "IFRS 5",
                    "reference": "IFRS 5.33(c)",
                    "question": "Does the entity disclose the net cash flows from operating activities of discontinued operations?"
                },
                {
                    "id": "IFRS5-1.5",
                    "section": "IFRS 5",
                    "reference": "IFRS 5.33(c)",
                    "question": "Does the entity disclose the net cash flows from investing activities of discontinued operations?"
                },
                {
                    "id": "IFRS5-1.6",
                    "section": "IFRS 5",
                    "reference": "IFRS 5.33(c)",
                    "question": "Does the entity disclose the net cash flows from financing activities of discontinued operations?"
                },
                {
                    "id": "IFRS5-1.7",
                    "section": "IFRS 5",
                    "reference": "IFRS 5.33(d)",
                    "question": "Does the entity disclose the income from continuing operations and from discontinued operations attributable to owners of the parent?"
                },
                {
                    "id": "IFRS5-2",
                    "section": "IFRS 5",
                    "reference": "IFRS 5.34",
                    "question": "Does the entity re-present the disclosures in IFRS 5.33 for prior periods so they relate to all operations discontinued by the end of the current reporting period?"
                },
                {
                    "id": "IFRS5-3",
                    "section": "IFRS 5",
                    "reference": "IFRS 5.35",
                    "question": "Does the entity separately classify and disclose adjustments in the current period to previously presented discontinued operations amounts that relate directly to disposals in prior periods?"
                },
                {
                    "id": "IFRS5-4",
                    "section": "IFRS 5",
                    "reference": "IFRS 5.36",
                    "question": "If a component ceases to be classified as held for sale, does the entity reclassify its results out of discontinued operations into continuing operations for all periods presented?"
                },
                {
                    "id": "IFRS5-5",
                    "section": "IFRS 5",
                    "reference": "IFRS 5.36A",
                    "question": "If a subsidiary meeting discontinued-operation criteria is subject to a sale plan, does the entity disclose the IFRS 5.33–36 information for that subsidiary?"
                },
                {
                    "id": "IFRS5-6",
                    "section": "IFRS 5",
                    "reference": "IFRS 5.30",
                    "question": "Does the entity present information that enables users to evaluate the financial effects of disposals of non-current assets or disposal groups held for sale?"
                },
                {
                    "id": "IFRS5-7.1",
                    "section": "IFRS 5",
                    "reference": "IFRS 5.38(a)",
                    "question": "Does the entity present non-current assets and assets of disposal groups held for sale separately from other assets in the statement of financial position?"
                },
                {
                    "id": "IFRS5-7.2",
                    "section": "IFRS 5",
                    "reference": "IFRS 5.38(b)",
                    "question": "Does the entity present liabilities of disposal groups held for sale separately from other liabilities in the statement of financial position?"
                },
                {
                    "id": "IFRS5-7.3",
                    "section": "IFRS 5",
                    "reference": "IFRS 5.38(c)",
                    "question": "Does the entity present assets and liabilities held for sale on a gross basis, not offsetting them?"
                },
                {
                    "id": "IFRS5-7.4",
                    "section": "IFRS 5",
                    "reference": "IFRS 5.38(d)",
                    "question": "Does the entity disclose the major classes of assets and liabilities held for sale, except for newly acquired subsidiaries meeting held-for-sale on acquisition criteria?"
                },
                {
                    "id": "IFRS5-7.5",
                    "section": "IFRS 5",
                    "reference": "IFRS 5.38(e)",
                    "question": "Does the entity disclose cumulative income or expense recognised in other comprehensive income relating to assets or disposal groups held for sale?"
                },
                {
                    "id": "IFRS5-8.1",
                    "section": "IFRS 5",
                    "reference": "IFRS 5.41(a)",
                    "question": "In the period a non-current asset or disposal group is classified as held for sale or sold, does the entity describe the asset or disposal group?"
                },
                {
                    "id": "IFRS5-8.2",
                    "section": "IFRS 5",
                    "reference": "IFRS 5.41(b)",
                    "question": "Does the entity disclose the facts and circumstances of the sale or expected disposal and its timing and manner?"
                },
                {
                    "id": "IFRS5-8.3",
                    "section": "IFRS 5",
                    "reference": "IFRS 5.41(c)",
                    "question": "Does the entity disclose the gain or loss recognised under IFRS 5.20–22 and, if not separately presented, the caption in the statement of comprehensive income where it is included?"
                },
                {
                    "id": "IFRS5-8.4",
                    "section": "IFRS 5",
                    "reference": "IFRS 5.41(d)",
                    "question": "Does the entity disclose the reportable segment in which the held-for-sale asset or disposal group is presented under IFRS 8, if applicable?"
                },
                {
                    "id": "IFRS5-9.1",
                    "section": "IFRS 5",
                    "reference": "IFRS 5.26–29, 5.42",
                    "question": "If the entity reverses held-for-sale classification, does it disclose the facts and circumstances leading to that decision?"
                },
                {
                    "id": "IFRS5-9.2",
                    "section": "IFRS 5",
                    "reference": "IFRS 5.26–29, 5.42",
                    "question": "Does the entity disclose the effect of that decision on the period’s and prior periods’ results?"
                },
                {
                    "id": "IFRS5-10",
                    "section": "IFRS 5",
                    "reference": "IFRS 5 & IFRS 13.5–7",
                    "question": "For fair-value measurements (including fair value less costs to sell) required by IFRS 5, does the entity provide the disclosures required by IFRS 13?"
                },
                {
                    "id": "IFRS5-11",
                    "section": "IFRS 5",
                    "reference": "IFRS 5.12",
                    "question": "If held-for-sale criteria are met after period end but before authorisation, does the entity disclose in notes the information specified in IFRS 5.41(a), (b) and (d)?"
                }
            ]
        }
    ]
}