{
    "title": "IFRS 18 Disclosure Checklist",
    "version": "1.0",
    "sections": [
        {
            "section": "IFRS 18",
            "title": "General",
            "description": "Checklist for presentation and disclosure requirements under IFRS 18.",
            "items": [
               {
                "id": "657",
                "section": "IFRS 18",
                "reference": "IFRS 18.25",
                "question": "Are the financial statements identified clearly and distinguished from other information in the same published document?"
            },
            {
                "id": "658.1",
                "section": "IFRS 18",
                "reference": "IFRS 18.10",
                "question": "Does the entity present a statement (or statements) of financial performance for the reporting period?"
            },
            {
                "id": "658.2",
                "section": "IFRS 18",
                "reference": "IFRS 18.10",
                "question": "Does the entity present a statement of financial position as at the end of the reporting period?"
            },
            {
                "id": "658.3",
                "section": "IFRS 18",
                "reference": "IFRS 18.10",
                "question": "Does the entity present a statement of changes in equity for the reporting period?"
            },
            {
                "id": "658.4",
                "section": "IFRS 18",
                "reference": "IFRS 18.10",
                "question": "Does the entity present a statement of cash flows for the reporting period?"
            },
            {
                "id": "658.5",
                "section": "IFRS 18",
                "reference": "IFRS 18.10",
                "question": "Does the entity present notes for the reporting period?"
            },
            {
                "id": "658.6",
                "section": "IFRS 18",
                "reference": "IFRS 18.10",
                "question": "Does the entity provide comparative information in respect of the preceding period as specified in IFRS 18.31–32?"
            },
            {
                "id": "658.7",
                "section": "IFRS 18",
                "reference": "IFRS 18.10",
                "question": "Does the entity present a statement of financial position as at the beginning of the preceding period if required by IFRS 18.37?"
            },
            {
                "id": "659",
                "section": "IFRS 18",
                "reference": "IFRS 18.27",
                "question": "Does the entity clearly identify each primary financial statement and the notes?"
            },
            {
                "id": "660.1",
                "section": "IFRS 18",
                "reference": "IFRS 18.27 IAS 21.8 IFRS 18.B11",
                "question": "Does the entity disclose prominently the name of the reporting entity or other means of identification, and any change in that information from the end of the preceding reporting period?"
            },
            {
                "id": "660.2",
                "section": "IFRS 18",
                "reference": "IFRS 18.27 IAS 21.8 IFRS 18.B11",
                "question": "Does the entity disclose prominently whether the financial statements are of an individual entity or a group of entities?"
            },
            {
                "id": "660.3",
                "section": "IFRS 18",
                "reference": "IFRS 18.27 IAS 21.8 IFRS 18.B11",
                "question": "Does the entity disclose prominently the date of the end of the reporting period or the period covered by the financial statements?"
            },
            {
                "id": "660.4",
                "section": "IFRS 18",
                "reference": "IFRS 18.27 IAS 21.8 IFRS 18.B11",
                "question": "Does the entity disclose prominently the presentation currency, as defined in IAS 21 The Effects of Changes in Foreign Exchange Rates?"
            },
            {
                "id": "660.5",
                "section": "IFRS 18",
                "reference": "IFRS 18.27 IAS 21.8 IFRS 18.B11",
                "question": "Does the entity disclose prominently the level of rounding used for the amounts in the financial statements?"
            },
            {
                "id": "661.1",
                "section": "IFRS 18",
                "reference": "IFRS 18.116",
                "question": "If not disclosed elsewhere, does the entity disclose in the notes the domicile and legal form of the entity, its country of incorporation and the address of its registered office (or principal place of business)?"
            },
            {
                "id": "661.2",
                "section": "IFRS 18",
                "reference": "IFRS 18.116",
                "question": "If not disclosed elsewhere, does the entity disclose in the notes a description of the nature of the entity's operations and its principal activities?"
            },
            {
                "id": "661.3",
                "section": "IFRS 18",
                "reference": "IFRS 18.116",
                "question": "If not disclosed elsewhere, does the entity disclose in the notes the name of the parent and the ultimate parent of the group?"
            },
            {
                "id": "661.4",
                "section": "IFRS 18",
                "reference": "IFRS 18.116",
                "question": "If not disclosed elsewhere, does the entity disclose in the notes information regarding the length of life if it is a limited-life entity?"
            },
            {
                "id": "662",
                "section": "IFRS 18",
                "reference": "IAS 8.6A IAS 8.6C IFRS 18.113",
                "question": "Does the entity provide additional disclosures when compliance with IFRS is insufficient to enable users to understand the impact of transactions, events, and conditions on its financial position and performance?"
            },
            {
                "id": "663",
                "section": "IFRS 18",
                "reference": "IAS 8.6B",
                "question": "Does the entity disclose an explicit and unreserved statement of compliance with IFRS Accounting Standards?"
            },
            {
                "id": "664.1",
                "section": "IFRS 18",
                "reference": "IAS 8.6E IAS 8.6F",
                "question": "Does the entity disclose that management concluded the financial statements present fairly the entity's financial position, performance and cash flows?"
            },
            {
                "id": "664.2",
                "section": "IFRS 18",
                "reference": "IAS 8.6E IAS 8.6F",
                "question": "Does the entity disclose that it has complied with applicable IFRSs, except where it departed to achieve a fair presentation?"
            },
            {
                "id": "664.3",
                "section": "IFRS 18",
                "reference": "IAS 8.6E IAS 8.6F",
                "question": "Does the entity disclose the title of the IFRS from which it has departed?"
            },
            {
                "id": "664.4",
                "section": "IFRS 18",
                "reference": "IAS 8.6E IAS 8.6F",
                "question": "Does the entity disclose the nature of the departure?"
            },
            {
                "id": "664.5",
                "section": "IFRS 18",
                "reference": "IAS 8.6E IAS 8.6F",
                "question": "Does the entity disclose the treatment that the IFRS would require?"
            },
            {
                "id": "664.6",
                "section": "IFRS 18",
                "reference": "IAS 8.6E IAS 8.6F",
                "question": "Does the entity disclose the reason why that treatment would be misleading?"
            },
            {
                "id": "664.7",
                "section": "IFRS 18",
                "reference": "IAS 8.6E IAS 8.6F",
                "question": "Does the entity disclose the treatment adopted?"
            },
            {
                "id": "664.8",
                "section": "IFRS 18",
                "reference": "IAS 8.6E IAS 8.6F",
                "question": "Does the entity disclose, for each period presented, the financial effect of the departure on each item in the financial statements?"
            },
            {
                "id": "665.1",
                "section": "IFRS 18",
                "reference": "IAS 8.6G IAS 8.6F",
                "question": "If a prior-period departure affects current amounts, does the entity disclose the title of the IFRS from which it departed?"
            },
            {
                "id": "665.2",
                "section": "IFRS 18",
                "reference": "IAS 8.6G IAS 8.6F",
                "question": "If a prior-period departure affects current amounts, does the entity disclose the nature of the departure?"
            },
            {
                "id": "665.3",
                "section": "IFRS 18",
                "reference": "IAS 8.6G IAS 8.6F",
                "question": "If a prior-period departure affects current amounts, does the entity disclose the treatment the IFRS would require?"
            },
            {
                "id": "665.4",
                "section": "IFRS 18",
                "reference": "IAS 8.6G IAS 8.6F",
                "question": "If a prior-period departure affects current amounts, does the entity disclose the reason why that treatment would be misleading?"
            },
            {
                "id": "665.5",
                "section": "IFRS 18",
                "reference": "IAS 8.6G IAS 8.6F",
                "question": "If a prior-period departure affects current amounts, does the entity disclose the treatment adopted?"
            },
            {
                "id": "665.6",
                "section": "IFRS 18",
                "reference": "IAS 8.6G IAS 8.6F",
                "question": "If a prior-period departure affects current amounts, does the entity disclose the financial effect on each item for each period presented?"
            },
            {
                "id": "666.1",
                "section": "IFRS 18",
                "reference": "IAS 8.6I",
                "question": "If compliance is misleading but departure is prohibited, does the entity disclose the title of the IFRS in question?"
            },
            {
                "id": "666.2",
                "section": "IFRS 18",
                "reference": "IAS 8.6I",
                "question": "If compliance is misleading but departure is prohibited, does the entity disclose the nature of the requirement?"
            },
            {
                "id": "666.3",
                "section": "IFRS 18",
                "reference": "IAS 8.6I",
                "question": "If compliance is misleading but departure is prohibited, does the entity disclose the reason why complying is misleading?"
            },
            {
                "id": "666.4",
                "section": "IFRS 18",
                "reference": "IAS 8.6I",
                "question": "If compliance is misleading but departure is prohibited, does the entity disclose, for each period, the adjustments that would be necessary for a fair presentation?"
            },
            {
                "id": "667",
                "section": "IFRS 18",
                "reference": "IAS 8.6K",
                "question": "Does the entity disclose material uncertainties that may cast significant doubt on its ability to continue as a going concern?"
            },
            {
                "id": "668.1",
                "section": "IFRS 18",
                "reference": "IAS 8.6K",
                "question": "If the financial statements are not prepared on a going concern basis, does the entity disclose that fact?"
            },
            {
                "id": "668.2",
                "section": "IFRS 18",
                "reference": "IAS 8.6K",
                "question": "If the financial statements are not prepared on a going concern basis, does the entity disclose the basis on which they are prepared?"
            },
            {
                "id": "668.3",
                "section": "IFRS 18",
                "reference": "IAS 8.6K",
                "question": "If the financial statements are not prepared on a going concern basis, does the entity disclose the reason why it is not regarded as a going concern?"
            },
            {
                "id": "669.1",
                "section": "IFRS 18",
                "reference": "IFRS 18.28",
                "question": "If the reporting period changes and is longer or shorter than one year, does the entity disclose the reporting period covered by the financial statements?"
            },
            {
                "id": "669.2",
                "section": "IFRS 18",
                "reference": "IFRS 18.28",
                "question": "If the reporting period changes and is longer or shorter than one year, does the entity disclose the reason for using a longer or shorter period?"
            },
            {
                "id": "669.3",
                "section": "IFRS 18",
                "reference": "IFRS 18.28",
                "question": "If the reporting period changes and is longer or shorter than one year, does the entity disclose that amounts are not entirely comparable?"
            },
            {
                "id": "670",
                "section": "IFRS 18",
                "reference": "IFRS 18.31",
                "question": "Does the entity provide comparative information for the preceding period for all amounts reported in the current statements, except when IFRS permits or requires otherwise?"
            },
            {
                "id": "671",
                "section": "IFRS 18",
                "reference": "IFRS 18.31 IFRS 18.B13",
                "question": "Does the entity include comparative narrative and descriptive information if necessary to understand the current period's financial statements?"
            },
            {
                "id": "672.1",
                "section": "IFRS 18",
                "reference": "IFRS 18.33",
                "question": "If presentation or classification changes, does the entity disclose the nature of the reclassification (including at the beginning of the preceding period)?"
            },
            {
                "id": "672.2",
                "section": "IFRS 18",
                "reference": "IFRS 18.33",
                "question": "If presentation or classification changes, does the entity disclose the amount of each item or class of items that is reclassified?"
            },
            {
                "id": "672.3",
                "section": "IFRS 18",
                "reference": "IFRS 18.33",
                "question": "If presentation or classification changes, does the entity disclose the reason for the reclassification?"
            },
            {
                "id": "673.1",
                "section": "IFRS 18",
                "reference": "IFRS 18.34",
                "question": "If reclassification of comparatives is impracticable, does the entity disclose the reason for not reclassifying the amounts?"
            },
            {
                "id": "673.2",
                "section": "IFRS 18",
                "reference": "IFRS 18.34",
                "question": "If reclassification comparatives is impracticable, does the entity disclose the nature of the adjustments that would have been made?"
            },
            {
                "id": "674",
                "section": "IFRS 18",
                "reference": "IFRS 18.32 IFRS 18.B14-B15",
                "question": "Does the entity present the current and preceding period in each primary financial statement and in the notes?"
            },
            {
                "id": "675",
                "section": "IFRS 18",
                "reference": "IFRS 18.B14",
                "question": "When voluntarily presenting additional comparatives, does the entity present related note information for those additional statements?"
            },
            {
                "id": "676.1",
                "section": "IFRS 18",
                "reference": "IFRS 18.38",
                "question": "In the circumstances of IFRS 18.37, does the entity present a statement of financial position as at the end of the current period?"
            },
            {
                "id": "676.2",
                "section": "IFRS 18",
                "reference": "IFRS 18.38",
                "question": "In the circumstances of IFRS 18.37, does the entity present a statement of financial position as at the end of the preceding period?"
            },
            {
                "id": "676.3",
                "section": "IFRS 18",
                "reference": "IFRS 18.38",
                "question": "In the circumstances of IFRS 18.37, does the entity present a statement of financial position as at the beginning of the preceding period?"
            },
            {
                "id": "677",
                "section": "IFRS 18",
                "reference": "IFRS 18.39",
                "question": "When presenting a third statement of financial position, does the entity disclose the information required by IFRS 18.33–36 and IAS 8?"
            },
            {
                "id": "678",
                "section": "IFRS 18",
                "reference": "IFRS 18.40",
                "question": "When presenting a third statement of financial position, is its date the beginning of the preceding period regardless of earlier comparative information?"
            },
            {
                "id": "679.1",
                "section": "IFRS 18",
                "reference": "IFRS 18.30",
                "question": "Does the entity retain the presentation of items from one period to the next?"
            },
            {
                "id": "679.2",
                "section": "IFRS 18",
                "reference": "IFRS 18.30",
                "question": "Does the entity retain the disclosure of items from one period to the next?"
            },
            {
                "id": "679.3",
                "section": "IFRS 18",
                "reference": "IFRS 18.30",
                "question": "Does the entity retain the classification of items from one period to the next?"
            },
            {
                "id": "680.1",
                "section": "IFRS 18",
                "reference": "IAS 10.17",
                "question": "Does the entity disclose the date when the financial statements were authorised for issue?"
            },
            {
                "id": "680.2",
                "section": "IFRS 18",
                "reference": "IAS 10.17",
                "question": "Does the entity disclose who authorised the financial statements?"
            },
            {
                "id": "680.3",
                "section": "IFRS 18",
                "reference": "IAS 10.17",
                "question": "Does the entity disclose that owners or others have the power to amend the financial statements after issue, if applicable?"
            }
            ]
        },
        {
            "section": "IFRS 18",
            "title": "Financial review by management",
            "description": "Checklist for presentation and disclosure requirements under IFRS 18.",
            "items": [
                {
                    "id": "681",
                    "section": "IFRS 18",
                    "reference": "IFRS 18.8",
                    "question": "Does the entity provide information for financial review by management, which is separate from the financial statements, that describes and explains the main features of its financial performance and financial position and the principal uncertainties it faces"
                }
            ]
        },
        {
            "section": "IFRS 18",
            "title": "Aggregation and disaggregation",
            "description": "Checklist for presentation and disclosure requirements under IFRS 18.",
            "items": [
                
  {
    "id": "682.1",
    "section": "IFRS 18",
    "reference": "IFRS 18.41 IFRS 18.B16-B23",
    "question": "Does the entity classify and aggregate assets, liabilities, equity, income, expenses or cash flows into items based on shared characteristics, unless doing so would override specific aggregation or disaggregation requirements in IFRS?"
  },
  {
    "id": "682.2",
    "section": "IFRS 18",
    "reference": "IFRS 18.41 IFRS 18.B16-B23",
    "question": "Does the entity disaggregate items based on characteristics that are not shared, unless doing so would override specific aggregation or disaggregation requirements in IFRS?"
  },
  {
    "id": "682.3",
    "section": "IFRS 18",
    "reference": "IFRS 18.41 IFRS 18.B16-B23",
    "question": "Does the entity aggregate or disaggregate items to present line items in the primary financial statements that fulfil their role of providing useful structured summaries, unless doing so would override specific IFRS requirements?"
  },
  {
    "id": "682.4",
    "section": "IFRS 18",
    "reference": "IFRS 18.41 IFRS 18.B16-B23",
    "question": "Does the entity aggregate or disaggregate items to disclose information in the notes that fulfils their role of providing material information, unless doing so would override specific IFRS requirements?"
  },
  {
    "id": "682.5",
    "section": "IFRS 18",
    "reference": "IFRS 18.41 IFRS 18.B16-B23",
    "question": "Does the entity ensure that its aggregation and disaggregation do not obscure material information, unless doing so would override specific IFRS requirements?"
  },
  {
    "id": "683",
    "section": "IFRS 18",
    "reference": "IFRS 18.42",
    "question": "Does the entity disaggregate items under IFRS 18.41 whenever the resulting information is material?"
  },
  {
    "id": "684",
    "section": "IFRS 18",
    "reference": "IFRS 18.42 IFRS 18.B79 IFRS 18.B111",
    "question": "If, applying IFRS 18.41(c), the entity does not present material information in the primary financial statements, does it disclose that information in the notes?"
  },
  {
    "id": "685",
    "section": "IFRS 18",
    "reference": "IFRS 18.43 IFRS 18.B24 IFRS 18.B25 IFRS 18.B26",
    "question": "Does the entity label and describe items presented in the primary financial statements or in the notes in a way that faithfully represents the characteristics of each item?"
  },
  {
    "id": "686",
    "section": "IFRS 18",
    "reference": "IFRS 18.43",
    "question": "To faithfully represent an item, does the entity provide all descriptions and explanations necessary for users to understand that item?"
  },
  {
    "id": "687",
    "section": "IFRS 18",
    "reference": "IFRS 18.44-45",
    "question": "Does the entity separately report assets and liabilities, and income and expenses, unless offsetting is required or permitted by an IFRS accounting standard?"
  }


            ]
        },
        {
            "section": "IFRS 18",
            "title": "Statement of profit or loss",
            "description": "Checklist for presentation and disclosure requirements under IFRS 18.",
            "items": [
                {
                    "id": "688",
                    "section": "IFRS 18",
                    "reference": "IFRS 18.42",
                    "question": "Does the entity disaggregate items under IFRS 18.41 whenever the resulting information is material?"
                },
                {
                    "id": "689",
                    "section": "IFRS 18",
                    "reference": "IFRS 18.42 IFRS 18.B79 IFRS 18.B111",
                    "question": "If, applying IFRS 18.41(c), the entity does not present material information in the primary financial statements, does it disclose that information in the notes?"
                },
                {
                    "id": "690",
                    "section": "IFRS 18",
                    "reference": "IFRS 18.46",
                    "question": "Does the entity include all items of income and expense in a reporting period in the statement of profit or loss, unless an IFRS accounting standard requires or permits otherwise?"
                },
                {
                    "id": "691",
                    "section": "IFRS 18",
                    "reference": "IFRS 18.51(a)",
                    "question": "If the entity invests in assets as a main business activity, does the entity disclose that fact?"
                },
                {
                    "id": "692",
                    "section": "IFRS 18",
                    "reference": "IFRS 18.51(b)",
                    "question": "If the entity provides financing to customers as a main business activity, does the entity disclose that fact?"
                },
                {
                    "id": "693.1",
                    "section": "IFRS 18",
                    "reference": "IFRS 18.51(c)",
                    "question": "If the outcome of the assessment has changed, does the entity disclose that fact and the date of the change?"
                },
                {
                    "id": "693.2",
                    "section": "IFRS 18",
                    "reference": "IFRS 18.51(c)",
                    "question": "Does the entity disclose the amount and classification of items of income and expense before and after the date of the change in the outcome of the assessment in the current period?"
                },
                {
                    "id": "693.3",
                    "section": "IFRS 18",
                    "reference": "IFRS 18.51(c)",
                    "question": "Does the entity disclose the amount and classification in the prior period for items whose classification changed because of the changed outcome of the assessment?"
                },
                {
                    "id": "693.4",
                    "section": "IFRS 18",
                    "reference": "IFRS 18.51(c)",
                    "question": "If the entity does not disclose the information specified in (c) above because it is impracticable, does it disclose that fact?"
                },
                {
                    "id": "694",
                    "section": "IFRS 18",
                    "reference": "IFRS 18.B41",
                    "question": "Does the entity classify and present income and expenses applying the change in outcome of the assessment prospectively from the date of the change and not reclassify amounts presented before that date?"
                },
                {
                    "id": "695",
                    "section": "IFRS 18",
                    "reference": "IFRS 18.52",
                    "question": "Does the entity classify in the operating category all income and expenses included in the statement of profit or loss that are not classified in the investing, financing, income taxes, or discontinued operations categories?"
                },
                {
                    "id": "696.1",
                    "section": "IFRS 18",
                    "reference": "IFRS 18.53",
                    "question": "Does the entity classify income and expenses related to investments in associates, joint ventures and unconsolidated subsidiaries in the investing category?"
                },
                {
                    "id": "696.2",
                    "section": "IFRS 18",
                    "reference": "IFRS 18.53",
                    "question": "Does the entity classify income and expenses related to cash and cash equivalents in the investing category?"
                },
                {
                    "id": "696.3",
                    "section": "IFRS 18",
                    "reference": "IFRS 18.53",
                    "question": "Does the entity classify income and expenses related to other assets that generate a return individually and largely independently of its other resources in the investing category?"
                },
                {
                    "id": "697.1",
                    "section": "IFRS 18",
                    "reference": "IFRS 18.55",
                    "question": "If the entity invests in associates, joint ventures and unconsolidated subsidiaries and accounts for them using the equity method, does it classify related income and expenses in the investing category?"
                },
                {
                    "id": "697.2",
                    "section": "IFRS 18",
                    "reference": "IFRS 18.55",
                    "question": "If the entity invests in associates, joint ventures and unconsolidated subsidiaries and does not account for them using the equity method, does it classify related income and expenses in the operating category?"
                },
                {
                    "id": "698",
                    "section": "IFRS 18",
                    "reference": "IFRS 18.56(a)",
                    "question": "If the entity invests in financial assets that generate a return individually and largely independently of its other resources, does it classify related income and expenses on cash and cash equivalents in the operating category?"
                },
                {
                    "id": "699.1",
                    "section": "IFRS 18",
                    "reference": "IFRS 18.56(b)",
                    "question": "If the entity provides financing to customers and does not meet the criteria in IFRS 18.56(a), does it classify related income and expenses from cash and cash equivalents that relate to providing financing to customers in the operating category?"
                },
                {
                    "id": "699.2",
                    "section": "IFRS 18",
                    "reference": "IFRS 18.56(b)",
                    "question": "If the entity provides financing to customers and does not meet the criteria in IFRS 18.56(a), does it classify related income and expenses from cash and cash equivalents that do not relate to providing financing to customers based on an accounting policy choice between operating or investing category?"
                },
                {
                    "id": "700",
                    "section": "IFRS 18",
                    "reference": "IFRS 18.58",
                    "question": "If the entity invests in other assets that generate a return individually and largely independently of its other resources, does it classify related income and expenses on those assets in the operating category?"
                },
                {
                    "id": "701.1",
                    "section": "IFRS 18",
                    "reference": "IFRS 18.60",
                    "question": "Does the entity classify income and expenses from the initial and subsequent measurement of liabilities arising from transactions that involve only the raising of finance in the financing category, except as set out in IFRS 18.63–66?"
                },
                {
                    "id": "701.2",
                    "section": "IFRS 18",
                    "reference": "IFRS 18.60",
                    "question": "Does the entity classify incremental expenses directly attributable to the issue and extinguishment of liabilities arising from transactions that involve only the raising of finance in the financing category?"
                },
                {
                    "id": "702.1",
                    "section": "IFRS 18",
                    "reference": "IFRS 18.61",
                    "question": "Does the entity classify interest income and expenses from liabilities arising from transactions that do not involve only the raising of finance in the financing category if identified for IFRS purposes?"
                },
                {
                    "id": "702.2",
                    "section": "IFRS 18",
                    "reference": "IFRS 18.61",
                    "question": "Does the entity classify income and expenses arising from changes in interest rates on liabilities arising from transactions that do not involve only the raising of finance in the financing category if identified for IFRS purposes?"
                },
                {
                    "id": "703.1",
                    "section": "IFRS 18",
                    "reference": "IFRS 18.B70",
                    "question": "Does the entity classify gains and losses on a hedging instrument designated under IFRS 9 in the same category as the income and expenses affected by the risks managed?"
                },
                {
                    "id": "703.2",
                    "section": "IFRS 18",
                    "reference": "IFRS 18.B70",
                    "question": "Does the entity classify gains and losses on a hedging instrument designated under IFRS 9 in the operating category if required to avoid grossing up?"
                },
                {
                    "id": "704",
                    "section": "IFRS 18",
                    "reference": "IFRS 18.B71",
                    "question": "Does the entity classify gains and losses on an undesignated component of a designated hedging instrument in the same category as the designated component?"
                },
                {
                    "id": "705",
                    "section": "IFRS 18",
                    "reference": "IFRS 18.B71",
                    "question": "Does the entity classify ineffective portions of a gain or loss in the same category as the effective portions?"
                },
                {
                    "id": "706.1",
                    "section": "IFRS 18",
                    "reference": "IFRS 18.B72",
                    "question": "Does the entity classify gains and losses on a derivative not designated as a hedge under IFRS 9 in the same category as the income and expenses affected by the risks managed?"
                },
                {
                    "id": "706.2",
                    "section": "IFRS 18",
                    "reference": "IFRS 18.B72",
                    "question": "Does the entity classify gains and losses on a derivative not designated as a hedge under IFRS 9 in the operating category if required to avoid grossing up or undue cost or effort?"
                },
                {
                    "id": "707.1",
                    "section": "IFRS 18",
                    "reference": "IFRS 18.B73",
                    "question": "Does the entity classify gains and losses on a derivative not used to manage identified risks in the financing category if it relates to raising finance, or in the operating category if the entity provides financing to customers as a main business activity?"
                },
                {
                    "id": "707.2",
                    "section": "IFRS 18",
                    "reference": "IFRS 18.B73",
                    "question": "Does the entity classify gains and losses on a derivative not used to manage identified risks in the operating category if the conditions in IFRS 18.B73(a) are not met?"
                },
                {
                    "id": "708.1",
                    "section": "IFRS 18",
                    "reference": "IFRS 18.64",
                    "question": "Does the entity exclude from the financing category and classify in the operating category income and expenses from issued investment contracts with participation features recognised under IFRS 9?"
                },
                {
                    "id": "708.2",
                    "section": "IFRS 18",
                    "reference": "IFRS 18.64",
                    "question": "Does the entity exclude from the financing category and classify in the operating category insurance finance income and expenses recognised under IFRS 17?"
                },
                {
                    "id": "709.1",
                    "section": "IFRS 18",
                    "reference": "IFRS 18.65(a)",
                    "question": "If the entity provides financing to customers, does it classify income and expenses from liabilities that arise from transactions involving only the raising of finance in the operating category when those liabilities relate to providing financing?"
                },
                {
                    "id": "709.2",
                    "section": "IFRS 18",
                    "reference": "IFRS 18.65(a)",
                    "question": "If the entity provides financing to customers, does it classify income and expenses from liabilities that arise from transactions involving only the raising of finance based on an accounting policy choice when those liabilities do not relate to providing financing?"
                },
                {
                    "id": "709.3",
                    "section": "IFRS 18",
                    "reference": "IFRS 18.65(a)",
                    "question": "If the entity cannot distinguish between liabilities related and not related to providing financing to customers, does it classify all related income and expenses in the operating category?"
                },
                {
                    "id": "710.1",
                    "section": "IFRS 18",
                    "reference": "IFRS 18.65(b)",
                    "question": "If the entity provides financing to customers, does it classify income and expenses from liabilities that arise from transactions not involving only the raising of finance in the financing category when specified in IFRS 18.61?"
                },
                {
                    "id": "710.2",
                    "section": "IFRS 18",
                    "reference": "IFRS 18.65(b)",
                    "question": "If the entity provides financing to customers, does it classify income and expenses from liabilities that arise from transactions not involving only the raising of finance in the operating category when not specified in IFRS 18.61?"
                },
                {
                    "id": "711",
                    "section": "IFRS 18",
                    "reference": "IFRS 18.67",
                    "question": "Does the entity classify in the income taxes category tax expense or tax income included in the statement of profit or loss under IAS 12, including related foreign exchange differences?"
                },
                {
                    "id": "712",
                    "section": "IFRS 18",
                    "reference": "IFRS 18.68",
                    "question": "Does the entity classify income and expenses from discontinued operations in the discontinued operations category as required by IFRS 5?"
                },
                {
                    "id": "713",
                    "section": "IFRS 18",
                    "reference": "IFRS 18.B65",
                    "question": "Does the entity classify foreign exchange differences recognized under IAS 21 in the same category as the items that gave rise to them, unless doing so would involve undue cost or effort?"
                },
                {
                    "id": "714",
                    "section": "IFRS 18",
                    "reference": "IFRS 18.B68",
                    "question": "If applying classification requirements in IFRS 18.B65 and B67 would involve undue cost or effort, does the entity classify the affected foreign exchange differences in the operating category?"
                },
                {
                    "id": "715.1",
                    "section": "IFRS 18",
                    "reference": "IFRS 18.69",
                    "question": "Does the entity present totals and subtotals for operating profit or loss in the statement of profit or loss?"
                },
                {
                    "id": "715.2",
                    "section": "IFRS 18",
                    "reference": "IFRS 18.69",
                    "question": "Does the entity present totals and subtotals for profit or loss before financing and income taxes, subject to IFRS 18.73?"
                },
                {
                    "id": "715.3",
                    "section": "IFRS 18",
                    "reference": "IFRS 18.69",
                    "question": "Does the entity present totals and subtotals for profit or loss in the statement of profit or loss?"
                },
                {
                    "id": "716.1",
                    "section": "IFRS 18",
                    "reference": "IFRS 18.24 IFRS 18.B9",
                    "question": "Are additional line items and subtotals comprised of amounts recognized and measured in accordance with IFRS?"
                },
                {
                    "id": "716.2",
                    "section": "IFRS 18",
                    "reference": "IFRS 18.24 IFRS 18.B9",
                    "question": "Are additional line items and subtotals compatible with the structure required by IFRS 18.22?"
                },
                {
                    "id": "716.3",
                    "section": "IFRS 18",
                    "reference": "IFRS 18.24 IFRS 18.B9",
                    "question": "Are additional line items and subtotals consistent from period to period, in accordance with IFRS 18.30?"
                },
                {
                    "id": "716.4",
                    "section": "IFRS 18",
                    "reference": "IFRS 18.24 IFRS 18.B9",
                    "question": "Are additional line items and subtotals displayed no more prominently than the totals and subtotals required by IFRS?"
                }
            ]
        },
        {
            "section": "IFRS 18",
            "title": "Statement presenting comprehensive income",
            "description": "Checklist for presentation and disclosure requirements under IFRS 18.",
            "items": [
                {
                    "id": "722.1",
                    "section": "IFRS 18",
                    "reference": "IFRS 18.86",
                    "question": "Does the entity present in the statement presenting comprehensive income a total for profit or loss?"
                },
                {
                    "id": "722.2",
                    "section": "IFRS 18",
                    "reference": "IFRS 18.86",
                    "question": "Does the entity present in the statement presenting comprehensive income a total for other comprehensive income (see IFRS 18.B86–B87)?"
                },
                {
                    "id": "722.3",
                    "section": "IFRS 18",
                    "reference": "IFRS 18.86",
                    "question": "Does the entity present in the statement presenting comprehensive income a total for comprehensive income, being the total of profit or loss and other comprehensive income?"
                },
                {
                    "id": "723.1",
                    "section": "IFRS 18",
                    "reference": "IFRS 18.87",
                    "question": "Does the entity present an allocation of comprehensive income for the reporting period attributable to non-controlling interests?"
                },
                {
                    "id": "723.2",
                    "section": "IFRS 18",
                    "reference": "IFRS 18.87",
                    "question": "Does the entity present an allocation of comprehensive income for the reporting period attributable to owners of the parent?"
                },
                {
                    "id": "724.1",
                    "section": "IFRS 18",
                    "reference": "IFRS 18.88",
                    "question": "Does the entity classify income and expenses included in the statement presenting comprehensive income as those that will be reclassified to profit or loss when specific conditions are met?"
                },
                {
                    "id": "724.2",
                    "section": "IFRS 18",
                    "reference": "IFRS 18.88",
                    "question": "Does the entity classify income and expenses included in the statement presenting comprehensive income as those that will not be reclassified to profit or loss?"
                },
                {
                    "id": "725.1",
                    "section": "IFRS 18",
                    "reference": "IFRS 18.89",
                    "question": "Does the entity present, in each category of the statement presenting comprehensive income, a line item for the share of other comprehensive income of associates and joint ventures accounted for using the equity method?"
                },
                {
                    "id": "725.2",
                    "section": "IFRS 18",
                    "reference": "IFRS 18.89",
                    "question": "Does the entity present, in each category of the statement presenting comprehensive income, a line item for other items of other comprehensive income?"
                },
                {
                    "id": "726",
                    "section": "IFRS 18",
                    "reference": "IFRS 18.42",
                    "question": "Does the entity disaggregate items under IFRS 18.41 whenever the resulting information is material?"
                },
                {
                    "id": "727",
                    "section": "IFRS 18",
                    "reference": "IFRS 18.42 IFRS 18.B79 IFRS 18.B111",
                    "question": "If, applying IFRS 18.41(c), the entity does not present material information in the primary financial statements, does it disclose that information in the notes?"
                },
                {
                    "id": "728",
                    "section": "IFRS 18",
                    "reference": "IFRS 18.90",
                    "question": "Does the entity present in the statement presenting comprehensive income or disclose in the notes reclassification adjustments relating to components of other comprehensive income (see IFRS 18.B88–B89)?"
                },
                {
                    "id": "729",
                    "section": "IFRS 18",
                    "reference": "IFRS 18.92",
                    "question": "If the entity discloses reclassification adjustments in the notes, does it present in the statement presenting comprehensive income the items of other comprehensive income after any related reclassification adjustments?"
                },
                {
                    "id": "730",
                    "section": "IFRS 18",
                    "reference": "IFRS 18.93",
                    "question": "Does the entity either present in the statement presenting comprehensive income or disclose in the notes the amount of income taxes relating to each item of other comprehensive income, including reclassification adjustments?"
                }
            ]
        },
        {
            "section": "IFRS 18",
            "title": "Statement of financial position",
            "description": "Checklist for presentation and disclosure requirements under IFRS 18.",
            "items": [
                {
                    "id": "732",
                    "section": "IFRS 18",
                    "reference": "IFRS 18.96",
                    "question": "If the entity does not present separately current and non-current assets in its statement of financial position, does it present all assets in order of liquidity?"
                },
                {
                    "id": "733",
                    "section": "IFRS 18",
                    "reference": "IFRS 18.96",
                    "question": "If the entity does not present separately current and non-current liabilities in its statement of financial position, does it present all liabilities in order of liquidity?"
                },
                {
                    "id": "734",
                    "section": "IFRS 18",
                    "reference": "IFRS 18.97",
                    "question": "Does the entity disclose the amount expected to be recovered or settled after more than 12 months for each asset and liability line item that combines amounts expected to be recovered or settled within 12 months and amounts expected to be recovered or settled after 12 months?"
                },
                {
                    "id": "735",
                    "section": "IFRS 18",
                    "reference": "IFRS 18.98",
                    "question": "If the entity distinguishes between current and non-current assets in its financial statements, does it present deferred tax assets as non-current assets?"
                },
                {
                    "id": "736",
                    "section": "IFRS 18",
                    "reference": "IFRS 18.98",
                    "question": "If the entity distinguishes between current and non-current liabilities in its financial statements, does it present deferred tax liabilities as non-current liabilities?"
                },
                {
                    "id": "738.1",
                    "section": "IFRS 18",
                    "reference": "IFRS 18.99",
                    "question": "If the entity separately presents current and non-current assets, does it classify an asset as current when it is expected to be realised in, or is intended for sale or consumption in, the entity's normal operating cycle?"
                },
                {
                    "id": "738.2",
                    "section": "IFRS 18",
                    "reference": "IFRS 18.99",
                    "question": "If the entity separately presents current and non-current assets, does it classify an asset as current when it is held primarily for trading?"
                },
                {
                    "id": "738.3",
                    "section": "IFRS 18",
                    "reference": "IFRS 18.99",
                    "question": "If the entity separately presents current and non-current assets, does it classify an asset as current when it is expected to be realised within 12 months after the reporting period?"
                },
                {
                    "id": "738.4",
                    "section": "IFRS 18",
                    "reference": "IFRS 18.99",
                    "question": "If the entity separately presents current and non-current assets, does it classify an asset as current when it is cash or a cash equivalent, unless restricted from use to settle a liability for at least 12 months?"
                },
                {
                    "id": "739.1",
                    "section": "IFRS 18",
                    "reference": "IFRS 18.101",
                    "question": "If the entity separately presents current and non-current liabilities, does it classify a liability as current if it expects to settle it in its normal operating cycle?"
                },
                {
                    "id": "739.2",
                    "section": "IFRS 18",
                    "reference": "IFRS 18.101",
                    "question": "If the entity separately presents current and non-current liabilities, does it classify a liability as current if it holds it primarily for trading?"
                },
                {
                    "id": "739.3",
                    "section": "IFRS 18",
                    "reference": "IFRS 18.101",
                    "question": "If the entity separately presents current and non-current liabilities, does it classify a liability as current if it is due to be settled within 12 months after the reporting period?"
                },
                {
                    "id": "739.4",
                    "section": "IFRS 18",
                    "reference": "IFRS 18.101",
                    "question": "If the entity separately presents current and non-current liabilities, does it classify a liability as current if it does not have the right to defer settlement of the liability for at least 12 months after the reporting period?"
                },
                {
                    "id": "740.1",
                    "section": "IFRS 18",
                    "reference": "IFRS 18.B98",
                    "question": "If the entity separately presents current and non-current liabilities, does it classify its financial liabilities as current if they are due to be settled within 12 months after the reporting period, even if the original term was longer?"
                },
                {
                    "id": "740.2",
                    "section": "IFRS 18",
                    "reference": "IFRS 18.B98",
                    "question": "If the entity separately presents current and non-current liabilities, does it classify its financial liabilities as current if an agreement to refinance or reschedule payments on a long-term basis is completed after the reporting period but before authorization of the financial statements?"
                },
                {
                    "id": "741",
                    "section": "IFRS 18",
                    "reference": "IFRS 18.B102",
                    "question": "If the entity breaches a covenant on a long-term loan arrangement on or before the end of the reporting period, causing the liability to become payable on demand, does it classify that liability as current even if the lender agreed after period-end not to demand payment?"
                },
                {
                    "id": "742.1",
                    "section": "IFRS 18",
                    "reference": "IFRS 18.B106",
                    "question": "If the entity classifies loan liabilities as non-current subject to covenant compliance within 12 months, does it disclose information about the covenants (nature and timing) in the notes?"
                },
                {
                    "id": "742.2",
                    "section": "IFRS 18",
                    "reference": "IFRS 18.B106",
                    "question": "If the entity classifies loan liabilities as non-current subject to covenant compliance within 12 months, does it disclose the carrying amount of those liabilities in the notes?"
                },
                {
                    "id": "742.3",
                    "section": "IFRS 18",
                    "reference": "IFRS 18.B106",
                    "question": "If the entity classifies loan liabilities as non-current subject to covenant compliance within 12 months, does it disclose facts and circumstances indicating possible difficulty in complying with the covenants?"
                },
                {
                    "id": "743.1",
                    "section": "IFRS 18",
                    "reference": "IFRS 18.103",
                    "question": "Does the entity present property, plant and equipment as a separate line item in the statement of financial position?"
                },
                {
                    "id": "743.2",
                    "section": "IFRS 18",
                    "reference": "IFRS 18.103",
                    "question": "Does the entity present investment property as a separate line item in the statement of financial position?"
                },
                {
                    "id": "743.3",
                    "section": "IFRS 18",
                    "reference": "IFRS 18.103",
                    "question": "Does the entity present intangible assets as a separate line item in the statement of financial position?"
                },
                {
                    "id": "743.4",
                    "section": "IFRS 18",
                    "reference": "IFRS 18.103",
                    "question": "Does the entity present goodwill as a separate line item in the statement of financial position?"
                },
                {
                    "id": "743.5",
                    "section": "IFRS 18",
                    "reference": "IFRS 18.103",
                    "question": "Does the entity present financial assets (excluding amounts under g, j, k) as a separate line item in the statement of financial position?"
                },
                {
                    "id": "743.6",
                    "section": "IFRS 18",
                    "reference": "IFRS 18.103",
                    "question": "Does the entity present IFRS 17 contract assets, disaggregated per IFRS 17.78, as a separate line item?"
                },
                {
                    "id": "743.7",
                    "section": "IFRS 18",
                    "reference": "IFRS 18.103",
                    "question": "Does the entity present investments accounted for using the equity method as a separate line item?"
                },
                {
                    "id": "743.8",
                    "section": "IFRS 18",
                    "reference": "IFRS 18.103",
                    "question": "Does the entity present biological assets within the scope of IAS 41 as a separate line item?"
                },
                {
                    "id": "743.9",
                    "section": "IFRS 18",
                    "reference": "IFRS 18.103",
                    "question": "Does the entity present inventories as a separate line item?"
                },
                {
                    "id": "743.10",
                    "section": "IFRS 18",
                    "reference": "IFRS 18.103",
                    "question": "Does the entity present trade and other receivables as a separate line item?"
                },
                {
                    "id": "743.11",
                    "section": "IFRS 18",
                    "reference": "IFRS 18.103",
                    "question": "Does the entity present cash and cash equivalents as a separate line item?"
                },
                {
                    "id": "743.12",
                    "section": "IFRS 18",
                    "reference": "IFRS 18.103",
                    "question": "Does the entity present assets classified as held for sale and assets in disposal groups under IFRS 5 as a separate line item?"
                },
                {
                    "id": "743.13",
                    "section": "IFRS 18",
                    "reference": "IFRS 18.103",
                    "question": "Does the entity present trade and other payables as a separate line item?"
                },
                {
                    "id": "743.14",
                    "section": "IFRS 18",
                    "reference": "IFRS 18.103",
                    "question": "Does the entity present provisions as a separate line item?"
                },
                {
                    "id": "743.15",
                    "section": "IFRS 18",
                    "reference": "IFRS 18.103",
                    "question": "Does the entity present financial liabilities (excluding trade payables and provisions) as a separate line item?"
                },
                {
                    "id": "743.16",
                    "section": "IFRS 18",
                    "reference": "IFRS 18.103",
                    "question": "Does the entity present IFRS 17 contract liabilities, disaggregated per IFRS 17.78, as a separate line item?"
                },
                {
                    "id": "743.17",
                    "section": "IFRS 18",
                    "reference": "IFRS 18.103",
                    "question": "Does the entity present current tax liabilities and assets as a separate line item?"
                },
                {
                    "id": "743.18",
                    "section": "IFRS 18",
                    "reference": "IFRS 18.103",
                    "question": "Does the entity present deferred tax liabilities and assets as a separate line item?"
                },
                {
                    "id": "743.19",
                    "section": "IFRS 18",
                    "reference": "IFRS 18.103",
                    "question": "Does the entity present liabilities in disposal groups under IFRS 5 as a separate line item?"
                },
                {
                    "id": "744",
                    "section": "IFRS 18",
                    "reference": "IFRS 18.42",
                    "question": "Does the entity disaggregate items under IFRS 18.41 whenever the resulting information is material?"
                },
                {
                    "id": "745",
                    "section": "IFRS 18",
                    "reference": "IFRS 18.42 IFRS 18.B79 IFRS 18.B111",
                    "question": "If, applying IFRS 18.41(c), the entity does not present material information in the primary financial statements, does it disclose that information in the notes?"
                },
                {
                    "id": "746.1",
                    "section": "IFRS 18",
                    "reference": "IFRS 18.104",
                    "question": "Does the entity present non-controlling interests in the statement of financial position?"
                },
                {
                    "id": "746.2",
                    "section": "IFRS 18",
                    "reference": "IFRS 18.104",
                    "question": "Does the entity present issued capital and reserves attributable to owners of the parent in the statement of financial position?"
                },
                {
                    "id": "747.1",
                    "section": "IFRS 18",
                    "reference": "IFRS 18.103 IFRS 5.38",
                    "question": "Does the entity include non-current assets held for sale and assets in disposal groups under IFRS 5 as a separate line item?"
                },
                {
                    "id": "747.2",
                    "section": "IFRS 18",
                    "reference": "IFRS 18.103 IFRS 5.38",
                    "question": "Does the entity include liabilities in disposal groups under IFRS 5 as a separate line item?"
                }
            ]
        },
        {
            "section": "IFRS 18",
            "title": "Statement of changes in equity",
            "description": "Checklist for presentation and disclosure requirements under IFRS 18.",
            "items": [
                {
                    "id": "748.1",
                    "section": "IFRS 18",
                    "reference": "IFRS 18.107",
                    "question": "Does the statement of changes in equity include total comprehensive income for the reporting period, showing separately the total amounts attributable to owners of the parent and to non-controlling interests?"
                },
                {
                    "id": "748.2",
                    "section": "IFRS 18",
                    "reference": "IFRS 18.107",
                    "question": "Does the statement of changes in equity include, for each component of equity, the effects of retrospective application or retrospective restatement recognized in accordance with IAS 8?"
                },
                {
                    "id": "748.3",
                    "section": "IFRS 18",
                    "reference": "IFRS 18.107",
                    "question": "Does the statement of changes in equity include, for each component of equity, a reconciliation between the carrying amount at the beginning and end of the period showing changes resulting from profit or loss?"
                },
                {
                    "id": "748.4",
                    "section": "IFRS 18",
                    "reference": "IFRS 18.107",
                    "question": "Does the statement of changes in equity include, for each component of equity, a reconciliation between the carrying amount at the beginning and end of the period showing changes resulting from other comprehensive income?"
                },
                {
                    "id": "748.5",
                    "section": "IFRS 18",
                    "reference": "IFRS 18.107",
                    "question": "Does the statement of changes in equity include, for each component of equity, a reconciliation between the carrying amount at the beginning and end of the period showing changes resulting from transactions with owners in their capacity as owners, showing separately contributions by and distributions to owners and changes in ownership interests in subsidiaries that do not result in a loss of control?"
                },
                {
                    "id": "749",
                    "section": "IFRS 18",
                    "reference": "IFRS 18.109",
                    "question": "For each component of equity, does the entity either present in the statement of changes in equity or disclose in the notes an analysis of other comprehensive income by item?"
                },
                {
                    "id": "750",
                    "section": "IFRS 18",
                    "reference": "IFRS 18.42",
                    "question": "Does the entity disaggregate items under IFRS 18.41 whenever the resulting information is material?"
                },
                {
                    "id": "751",
                    "section": "IFRS 18",
                    "reference": "IFRS 18.42 IFRS 18.B79 IFRS 18.B111",
                    "question": "If, applying IFRS 18.41(c), the entity does not present material information in the primary financial statements, does it disclose that information in the notes?"
                },
                {
                    "id": "752.1",
                    "section": "IFRS 18",
                    "reference": "IFRS 18.110",
                    "question": "Does the entity present, either in the statement of changes in equity or in the notes, the amount of dividends recognised as distributions to owners during the reporting period?"
                },
                {
                    "id": "752.2",
                    "section": "IFRS 18",
                    "reference": "IFRS 18.110",
                    "question": "Does the entity present, either in the statement of changes in equity or in the notes, the related amount of dividends per share?"
                },
                {
                    "id": "753",
                    "section": "IFRS 18",
                    "reference": "IAS 32.39 IFRS 18.112",
                    "question": "Does the entity disclose the amount of transaction costs accounted for as a deduction from equity in the reporting period, in the statement of changes in equity or in the notes?"
                }
            ]
        },
        {
            "section": "IFRS 18",
            "title": "Notes to the financial statements",
            "description": "Checklist for presentation and disclosure requirements under IFRS 18.",
            "items": [
                {
                    "id": "755.1",
                    "section": "IFRS 18",
                    "reference": "IFRS 18.113",
                    "question": "Do the notes disclose the basis of preparation of the financial statements?"
                },
                {
                    "id": "755.2",
                    "section": "IFRS 18",
                    "reference": "IFRS 18.113",
                    "question": "Do the notes disclose the specific accounting policies used?"
                },
                {
                    "id": "755.3",
                    "section": "IFRS 18",
                    "reference": "IFRS 18.113",
                    "question": "Do the notes disclose information required by IFRS accounting standards that is not presented in the primary financial statements?"
                },
                {
                    "id": "755.4",
                    "section": "IFRS 18",
                    "reference": "IFRS 18.113",
                    "question": "Do the notes disclose information not presented in the primary financial statements but necessary for an understanding of any of them?"
                },
                {
                    "id": "756",
                    "section": "IFRS 18",
                    "reference": "IFRS 18.114",
                    "question": "Does the entity present notes to the financial statements in a systematic manner, as far as practicable?"
                },
                {
                    "id": "757.1",
                    "section": "IFRS 18",
                    "reference": "IFRS 18.114",
                    "question": "Does the entity cross-reference each item in the statement of financial performance to any related information in the notes?"
                },
                {
                    "id": "757.2",
                    "section": "IFRS 18",
                    "reference": "IFRS 18.114",
                    "question": "Does the entity cross-reference each item in the statement of financial position to any related information in the notes?"
                },
                {
                    "id": "757.3",
                    "section": "IFRS 18",
                    "reference": "IFRS 18.114",
                    "question": "Does the entity cross-reference each item in the statement of changes in equity to any related information in the notes?"
                },
                {
                    "id": "757.4",
                    "section": "IFRS 18",
                    "reference": "IFRS 18.114",
                    "question": "Does the entity cross-reference each item in the statement of cash flows to any related information in the notes?"
                },
                {
                    "id": "758",
                    "section": "IFRS 18",
                    "reference": "IFRS 18.114",
                    "question": "If amounts disclosed in the notes are included in one or more line items in the primary financial statements, does the entity disclose in the note the line item(s) in which those amounts are included?"
                },
                {
                    "id": "768",
                    "section": "IFRS 18",
                    "reference": "IFRS 18.126",
                    "question": "Does the entity disclose information that enables users to evaluate the entity's objectives, policies and processes for managing capital?"
                },
                {
                    "id": "769.1",
                    "section": "IFRS 18",
                    "reference": "IFRS 18.127",
                    "question": "Does the entity disclose qualitative information about its objectives, policies and processes for managing capital, including a description of what it manages as capital?"
                },
                {
                    "id": "769.2",
                    "section": "IFRS 18",
                    "reference": "IFRS 18.127",
                    "question": "Does the entity disclose the nature of externally imposed capital requirements and how those requirements are incorporated into its management of capital?"
                },
                {
                    "id": "769.3",
                    "section": "IFRS 18",
                    "reference": "IFRS 18.127",
                    "question": "Does the entity disclose how it is meeting its objectives for managing capital?"
                },
                {
                    "id": "769.4",
                    "section": "IFRS 18",
                    "reference": "IFRS 18.127",
                    "question": "Does the entity disclose summary quantitative data about what it manages as capital?"
                },
                {
                    "id": "769.5",
                    "section": "IFRS 18",
                    "reference": "IFRS 18.127",
                    "question": "Does the entity disclose any changes in its objectives, policies, processes or summary quantitative data from the preceding reporting period?"
                },
                {
                    "id": "769.6",
                    "section": "IFRS 18",
                    "reference": "IFRS 18.127",
                    "question": "Does the entity disclose whether, during the reporting period, it complied with any externally imposed capital requirements to which it is subject?"
                },
                {
                    "id": "769.7",
                    "section": "IFRS 18",
                    "reference": "IFRS 18.127",
                    "question": "If the entity did not comply with externally imposed capital requirements, does it disclose the consequences of such non-compliance?"
                }
            ]
        },
        {
            "section": "IFRS 18",
            "title": "Management-defined performance measures",
            "description": "Checklist for presentation and disclosure requirements under IFRS 18.",
            "items": [
                {
                    "id": "770.1",
                    "section": "IFRS 18",
                    "reference": "IFRS 18.121",
                    "question": "Does the entity disclose the aspect of financial performance that, in management's view, is communicated by a management-defined performance measure?"
                },
                {
                    "id": "770.2",
                    "section": "IFRS 18",
                    "reference": "IFRS 18.121",
                    "question": "Does the entity disclose how the management-defined performance measure compares with the measures defined by IFRS accounting standards?"
                },
                {
                    "id": "771",
                    "section": "IFRS 18",
                    "reference": "IFRS 18.122",
                    "question": "Does the entity disclose all management-defined performance measures in a single note, including a statement that they provide management's view of financial performance and are not necessarily comparable with similarly labeled measures of other entities?"
                },
                {
                    "id": "772.1",
                    "section": "IFRS 18",
                    "reference": "IFRS 18.123 IFRS 18.B134",
                    "question": "Does the entity label and describe each management-defined performance measure in a way that faithfully represents its characteristics in accordance with IFRS 18.43?"
                },
                {
                    "id": "772.2",
                    "section": "IFRS 18",
                    "reference": "IFRS 18.123 IFRS 18.B134",
                    "question": "If a measure is calculated other than by using the accounting policies used for items in the statement(s) of financial performance, does the entity disclose that fact and the calculations used for the measure?"
                },
                {
                    "id": "772.3",
                    "section": "IFRS 18",
                    "reference": "IFRS 18.123 IFRS 18.B134",
                    "question": "If the calculation of a management-defined performance measure differs from policies required or permitted by IFRS, does the entity disclose that fact and, if necessary, explain the meaning of terms it uses?"
                },
                {
                    "id": "773.1",
                    "section": "IFRS 18",
                    "reference": "IFRS 18.B135",
                    "question": "Does the entity label the measure in a way that represents the characteristics of the subtotal (e.g., using the label 'operating profit before non-recurring expenses' only for a subtotal excluding identified non-recurring expenses)?"
                },
                {
                    "id": "773.2",
                    "section": "IFRS 18",
                    "reference": "IFRS 18.B135",
                    "question": "Does the entity explain the meaning of terms it uses in its descriptions that are necessary to understand the aspect of financial performance being communicated (e.g., how it defines 'non-recurring expenses')?"
                },
                {
                    "id": "774.1",
                    "section": "IFRS 18",
                    "reference": "IFRS 18.123",
                    "question": "Does the entity disclose a description of the aspect of financial performance that, in management's view, is communicated by each management-defined performance measure, including why it provides useful information?"
                },
                {
                    "id": "774.2",
                    "section": "IFRS 18",
                    "reference": "IFRS 18.123",
                    "question": "Does the entity disclose how each management-defined performance measure is calculated?"
                },
                {
                    "id": "774.3",
                    "section": "IFRS 18",
                    "reference": "IFRS 18.123",
                    "question": "Does the entity disclose a reconciliation between each management-defined performance measure and the most directly comparable IFRS subtotal or total?"
                },
                {
                    "id": "774.4",
                    "section": "IFRS 18",
                    "reference": "IFRS 18.123",
                    "question": "Does the entity disclose the income tax effect (applying IFRS 18.B141) and the effect on non-controlling interests for each item in the reconciliation?"
                },
                {
                    "id": "774.5",
                    "section": "IFRS 18",
                    "reference": "IFRS 18.123",
                    "question": "Does the entity describe how it applies IFRS 18.B141 to determine the income tax effect required in the reconciliation?"
                },
                {
                    "id": "775.1",
                    "section": "IFRS 18",
                    "reference": "IFRS 18.124",
                    "question": "If the entity changes, adds, or ceases a management-defined performance measure, does it disclose an explanation enabling users to understand the change and its effects?"
                },
                {
                    "id": "775.2",
                    "section": "IFRS 18",
                    "reference": "IFRS 18.124",
                    "question": "Does the entity disclose the reasons for the change, addition, or cessation of a management-defined performance measure?"
                },
                {
                    "id": "775.3",
                    "section": "IFRS 18",
                    "reference": "IFRS 18.124",
                    "question": "Does the entity provide restated comparative information to reflect the change, addition, or cessation, unless it is impracticable to do so?"
                },
                {
                    "id": "776",
                    "section": "IFRS 18",
                    "reference": "IFRS 18.125",
                    "question": "If the entity does not disclose the required restated comparative information because it is impracticable, does it disclose that fact?"
                }
            ]
        },
        {
            "section": "IFRS 18",
            "title": "Transition to IFRS 18",
            "description": "Checklist for presentation and disclosure requirements under IFRS 18.",
            "items": [
                {
                    "id": "777",
                    "section": "IFRS 18",
                    "reference": "IFRS 18.C1",
                    "question": "If an entity applies IFRS 18, issued April 2024, in its financial statements for a period beginning before 1 January 2027, does it disclose that fact?"
                },
                {
                    "id": "778.1",
                    "section": "IFRS 18",
                    "reference": "IFRS 18.C3",
                    "question": "For the comparative period immediately preceding the first application of IFRS 18, does the entity disclose a reconciliation for each line item in the statement of profit or loss showing the amounts restated applying IFRS 18?"
                },
                {
                    "id": "778.2",
                    "section": "IFRS 18",
                    "reference": "IFRS 18.C3",
                    "question": "For the comparative period immediately preceding the first application of IFRS 18, does the entity disclose a reconciliation for each line item in the statement of profit or loss showing the amounts previously presented applying IAS 1?"
                }
            ]
        }
    ]
}
