{
    "title": "IFRS 15 Disclosure Checklist",
    "version": "1.0",
    "sections": [
        {
            "section": "IFRS 15",
            "title": "Revenue from Contracts with Customers",
            "description": "Checklist for presentation and disclosure requirements under IFRS 15.",
            "items": [
                {
                    "id": "509",
                    "section": "IFRS 15",
                    "reference": "IFRS 15.105",
                    "question": "Does the entity present any unconditional rights to consideration separately from contract assets as a receivable?"
                },
                {
                    "id": "510",
                    "section": "IFRS 15",
                    "reference": "IFRS 15.108",
                    "question": "Upon initial recognition of a receivable from a contract with a customer, does the entity present any difference between the measurement of the receivable in accordance with IFRS 9 and the corresponding amount of revenue as an expense (for example, as an impairment loss)?"
                },
                {
                    "id": "511",
                    "section": "IFRS 15",
                    "reference": "IFRS 15.107",
                    "question": "If the entity performs by transferring goods or services to a customer before the customer pays consideration or before payment is due, does the entity present the contract as a contract asset, excluding any amounts presented as a receivable?"
                },
                {
                    "id": "512",
                    "section": "IFRS 15",
                    "reference": "IFRS 15.106",
                    "question": "If a customer pays consideration, or the entity has a right to an amount of consideration that is unconditional (i.e., a receivable), before the entity transfers a good or service to the customer, does the entity present the contract as a contract liability when the payment is made or the payment is due (whichever is earlier)?"
                },
                {
                    "id": "513",
                    "section": "IFRS 15",
                    "reference": "IFRS 15.109",
                    "question": "If the entity uses an alternative description for a contract asset, does the entity provide sufficient information for a user of the financial statements to distinguish between receivables and contract assets?"
                },
                {
                    "id": "514",
                    "section": "IFRS 15",
                    "reference": "IFRS 15.65",
                    "question": "Does the entity present the effects of financing (interest revenue or interest expense) separately from revenue from contracts with customers in the statement of comprehensive income?"
                },
                {
                    "id": "515",
                    "section": "IFRS 15",
                    "reference": "IFRS 15.B25",
                    "question": "Does the entity present the asset for its right to recover products from a customer on settling a refund liability separately from the refund liability?"
                },
                {
                    "id": "516",
                    "section": "IFRS 15",
                    "reference": "IFRS 15.110",
                    "question": "To achieve the disclosure objective stated in IFRS 15.110, does the entity disclose qualitative and quantitative information about all of the following?"
                },
                {
                    "id": "517",
                    "section": "IFRS 15",
                    "reference": "IFRS 15.113",
                    "question": "Does the entity disclose all of the following amounts for the reporting period unless those amounts are presented separately in the statement of comprehensive income in accordance with other standards?"
                },
                {
                    "id": "518",
                    "section": "IFRS 15",
                    "reference": "IFRS 15.114",
                    "question": "Does the entity disaggregate revenue recognised from contracts with customers into categories that depict how the nature, amount, timing and uncertainty of revenue and cash flows are affected by economic factors?"
                },
                {
                    "id": "519",
                    "section": "IFRS 15",
                    "reference": "IFRS 15.115",
                    "question": "If the entity applies IFRS 8, does the entity disclose sufficient information to enable users of financial statements to understand the relationship between the disclosure of disaggregated revenue (in accordance with IFRS 15.114) and revenue information that is disclosed for each reportable segment?"
                },
                {
                    "id": "520",
                    "section": "IFRS 15",
                    "reference": "IFRS 15.116",
                    "question": "Does the entity disclose all of the following?"
                },
                {
                    "id": "521.1",
                    "section": "IFRS 15",
                    "reference": "IFRS 15.117",
                    "question": "Does the entity explain how the timing of satisfaction of its performance obligations relates to the typical timing of payment?"
                },
                {
                    "id": "521.2",
                    "section": "IFRS 15",
                    "reference": "IFRS 15.117",
                    "question": "Does the entity explain the effect that the timing of satisfaction and timing of payment have on the contract asset and contract liability balances?"
                },
                {
                    "id": "522",
                    "section": "IFRS 15",
                    "reference": "IFRS 15.118",
                    "question": "Does the entity provide an explanation (with both qualitative and quantitative information) of the significant changes in the contract asset and contract liability balances during the reporting period?"
                },
                {
                    "id": "523",
                    "section": "IFRS 15",
                    "reference": "IFRS 15.119",
                    "question": "Does the entity disclose information about its performance obligations in contracts with customers, including a description of all of the following?"
                },
                {
                    "id": "524",
                    "section": "IFRS 15",
                    "reference": "IFRS 15.120",
                    "question": "Does the entity disclose all of the following information about its remaining performance obligations?"
                },
                {
                    "id": "525",
                    "section": "IFRS 15",
                    "reference": "IFRS 15.122",
                    "question": "Does the entity explain qualitatively whether it is applying the practical expedient in IFRS 15.121 and whether any consideration is excluded from the transaction price and therefore excluded from the information disclosed under IFRS 15.120?"
                },
                {
                    "id": "526",
                    "section": "IFRS 15",
                    "reference": "IFRS 15.123",
                    "question": "Does the entity disclose the judgements, and changes in those judgements, made in applying IFRS 15 that significantly affect the determination of the amount and timing of revenue from contracts with customers?"
                },
                {
                    "id": "527",
                    "section": "IFRS 15",
                    "reference": "IFRS 15.124",
                    "question": "For performance obligations that the entity satisfies over time, does the entity disclose both of the following?"
                },
                {
                    "id": "528",
                    "section": "IFRS 15",
                    "reference": "IFRS 15.125",
                    "question": "For performance obligations satisfied at a point in time, does the entity disclose the significant judgements made in evaluating when a customer obtains control of promised goods or services?"
                },
                {
                    "id": "529",
                    "section": "IFRS 15",
                    "reference": "IFRS 15.126",
                    "question": "Does the entity disclose information about the methods, inputs and assumptions used for all of the following?"
                },
                {
                    "id": "530",
                    "section": "IFRS 15",
                    "reference": "IFRS 15.127",
                    "question": "Does the entity describe both of the following?"
                },
                {
                    "id": "531",
                    "section": "IFRS 15",
                    "reference": "IFRS 15.128",
                    "question": "Does the entity disclose all of the following?"
                },
                {
                    "id": "532",
                    "section": "IFRS 15",
                    "reference": "IFRS 15.129",
                    "question": "If the entity elects to use the practical expedient in IFRS 15.63 regarding the existence of a significant financing component, does the entity disclose that fact?"
                },
                {
                    "id": "533",
                    "section": "IFRS 15",
                    "reference": "IFRS 15.129",
                    "question": "If the entity elects to use the practical expedient in IFRS 15.94 regarding the incremental costs of obtaining a contract, does the entity disclose that fact?"
                }
            ]
        }
    ]
}