{
    "title": "Financial Reporting in Hyperinflationary Economies (Ind AS 29) Disclosure Checklist",
    "version": "1.0",
    "sections": [
        {
            "section": "Ind AS 29",
            "title": "Financial Reporting in Hyperinflationary Economies",
            "description": "Checklist for presentation and disclosure requirements under Ind AS 29.",
            "items": [
                {
                    "id": "291",
                    "section": "Ind AS 29",
                    "reference": "Ind AS 29.9",
                    "question": "Whether the entity has given separate disclosure of gain or loss on the net monetary position included in profit or loss?"
                },
                {
                    "id": "292",
                    "section": "Ind AS 29",
                    "reference": "Ind AS 29.39(a)",
                    "question": "Whether the entity has made disclosure of the fact that the financial statements and the corresponding figures for previous periods have been restated for the changes in the general purchasing power of the functional currency and, as a result, are stated in terms of the measuring unit current at the end of the reporting period?"
                },
                {
                    "id": "293",
                    "section": "Ind AS 29",
                    "reference": "Ind AS 29.39(b)",
                    "question": "Whether the entity has disclosed whether the financial statements are based on a historical cost approach or a current cost approach?"
                },
                {
                    "id": "294",
                    "section": "Ind AS 29",
                    "reference": "Ind AS 29.39(c)",
                    "question": "Whether the entity has disclosed the identity and level of the price index at the end of the reporting period and the movement in the index during the current and the previous reporting period?"
                },
                {
                    "id": "295",
                    "section": "Ind AS 29",
                    "reference": "Ind AS 29.39(d)",
                    "question": "Whether the entity has disclosed the duration of the hyperinflationary situation existing in the economy?"
                }
            ]
        }
    ]
}